[
    {
        "title": "Detecting Blue Team Research Through Targeted Ads",
        "speaker": "Detecting Blue Team Research Through Targeted Ads",
        "time": "2018-08-11T13:30:00.000Z",
        "location": "Track 2",
        "duration": "20 minutes",
        "abstract": "When my implant gets discovered how will I know? Did the implant stop responding for some benign reason or is the IR team responding? With any luck they'll upload the sample somewhere public so I can find it, but what if I can find out if they start looking for specific bread crumbles in public data sources? At some point without any internal data all blue teams turn to OSINT which puts their searches within view of the advertising industry. In this talk I will detail how I was able to use online advertising to detect when a blue team is hot on my trail."
    },
    {
        "title": "Hacking PLCs and Causing Havoc on Critical Infrastructures",
        "speaker": "Hacking PLCs and Causing Havoc on Critical Infrastructures",
        "time": "2018-08-11T11:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "Programmable Logic Controllers (PLCs) are devices used on a variety of industrial plants, from small factories to critical infrastructures like nuclear power plants, dams and wastewater systems. Although PLCs were made robust to sustain tough environments, little care was taken to raise defenses against potential cyber threats. As a consequence, threats started pouring in and causing havoc. During this presentation I will talk about the architecture of a PLC and how it can be p0wned. There will be some live demonstration attacks against 3 different brands of PLCs (if the demo demons allow it, if not I will just show a video). Additionally, I will demonstrate two vulnerabilities I recently discovered, affecting the Rockwell MicroLogix 1400 series and the Schneider Modicon M221 controllers."
    },
    {
        "title": "Asura: A huge PCAP file analyzer for anomaly packets detection using massive multithreading",
        "speaker": "Asura: A huge PCAP file analyzer for anomaly packets detection using massive multithreading",
        "time": "2018-08-12T13:30:00.000Z",
        "location": "Track 1",
        "duration": "20 minutes",
        "abstract": "Recently, the inspection of huge traffic log is imposing a great burden on security analysts. Unfortunately, there have been few research efforts focusing on scalablility in analyzing very large PCAP file with reasonable computing resources. Asura is a portable and scalable PCAP file analyzer for detecting anomaly packets using massive multithreading. Asura's parallel packet dump inspection is based on task-based decomposition and therefore can handle massive threads for large PCAP file without considering tidy parameter selection in adopting data decomposition. Asura is designed to scale out in processing large PCAP file by taking as many threads as possible. Asura takes two steps. First, Asura extracts feature vector represented by associative containers of <sourceIP, destIP> pair. By doing this, the feature vector can be drastically small compared with the size of original PCAP files.  In other words, Asura can reduce packet dump data into the size of unique <sourceIP, destIP> pairs (for example, in experiment, Asura's output which is reduced in first step is about 2% compared with the size of original libpcap files). Second, a parallel clustering algorithm is applied for the feature vector which is represented as {<sourceIP, destIP>, V[i]} where V[i] is aggregated flow vector. In second step, Asura adopts an enhanced Kmeans algorithm. Concretely, two functions of Kmeans which are (1)calculating distance and (2)relabeling points are improved for parallel processing. In experiment, in processing public PCAP datasets, Asura can identified 750 packets which are labeled as malicious from among 70 million (about 18GB) normal packets. In a nutshell, Asura successfully found 750 malicious packets in about 18GB packet dump. For Asura to inspect 70 million packets, it took reasonable computing time of around 350-450 minutes with 1000-5000 multithreading by running commodity workstation. Asura will be released under MIT license and available at author's GitHub site on the first day of DEF CON 26."
    },
    {
        "title": " One bite and all your dreams will come true: Analyzing and Attacking Apple Kernel Drivers",
        "speaker": " One bite and all your dreams will come true: Analyzing and Attacking Apple Kernel Drivers",
        "time": "2018-08-12T14:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "Though many security mechanisms are deployed in Apple's macOS and iOS systems, some old-fashioned or poor-quality kernel code still leaves the door widely open to attackers. Especially, as kernel's critical components, device drivers are frequently exploited to attack Apple systems. In fact, bug hunting in Apple kernel drivers is not easy since they are mostly closed-source and heavily relying on object-oriented programming. In this talk, we will share our experience of analyzing and attacking Apple kernel drivers. In specific, we will introduce a new tool called Ryuk. Ryuk employs static analysis techniques to discover bugs by itself or assist manual review. In addition, we further combine static analysis with dynamic fuzzing for bug hunting in Apple drivers. In specific, we will introduce how we integrate Ryuk to the state-of-art Apple driver fuzzer, PassiveFuzzFrameworkOSX, for finding exploitable bugs.  Most importantly, we will illustrate Ryuk's power with several new vulnerabilities that are recently discovered by Ryuk. In specific, we will show how we exploit these vulnerabilities for privilege escalation on macOS 10.13.3 and 10.13.2. We will not only explain why these bugs occur and how we find them, but also demonstrate how we exploit them with innovative kernel exploitation techniques."
    },
    {
        "title": "You may have paid more than you imagine—Replay Attacks on Ethereum Smart Contracts",
        "speaker": "You may have paid more than you imagine—Replay Attacks on Ethereum Smart Contracts",
        "time": "2018-08-11T10:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "In this paper, a new replay attack based on Ethereum smart contracts is presented. In the token transfer, the risk of replay attack cannot be completely avoided when the sender's signatures are abused, which can bring the loss to users. And the reason is that the applying scope of the signatures is not properly designed in the smart contracts. To test and verify this loophole, we selected two similar smart contracts for our experiment, at the same time, we used our own accounts in these two contracts to carry out the experiment. Because the same signatures of the two contracts were used in the experiment, we got a double income from sender successfully. The experiment verified that the replay attack is really exist. Besides, the replay attack may exist in multiple smart contracts. We calculated the number of smart contracts with this loophole, as well as the corresponding transaction activities, which find some Ethereum smart contracts are risked for this loophole. According to the vulnerability of the contract signature, the risk level is calibrated and depicted. Furthermore, the replay attack pattern is extended to within contract, cross contract and cross chain, which provide the pertinence and well reference for protection. Finally, the countermeasures are proposed to fix this vulnerability."
    },
    {
        "title": "What the Fax!?",
        "speaker": "What the Fax!?",
        "time": "2018-08-12T15:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "Unless you've been living under a rock for the past 30 years or so, you probably know what a fax machine is.  For decades, fax machines were used worldwide as the main way of electronic document delivery. But this happened in the 1980s. Humanity has since developed far more advanced ways to send digital content, and fax machines are all in the past, right? After all, they should now be nothing more than a glorified museum item. Who on earth is still using fax machines? The answer, to our great horror, is EVERYONE. State authorities, banks, service providers and many others are still using fax machines, despite their debatable quality and almost non-existent security. In fact, using fax machines is often mandatory and considered a solid and trustworthy method of delivering information. What the Fax?! We embarked on a journey with the singular goal of disrupting this insane state of affairs. We went to work, determined to show that the common fax machine could be compromised via mere access to its fully exposed and unprotected telephone line -- thus completely bypassing all perimeter security protections and shattering to pieces all modern-day security concepts. Join us as we take you through the strange world of embedded operating systems, 30-year-old protocols, museum grade compression algorithms, weird extensions and undebuggable environments. See for yourself first-hand as we give a live demonstration of the first ever full fax exploitation, leading to complete control over the entire device as well as the network, using nothing but a standard telephone line. This talk is intended to be the canary in the coal mine. The technology community cannot sit idly by while this ongoing madness is allowed to continue. The world must stop using FAX!"
    },
    {
        "title": "Rock appround the clock: Tracking malware developers by Android \"AAPT\" timezone disclosure bug",
        "speaker": "Rock appround the clock: Tracking malware developers by Android \"AAPT\" timezone disclosure bug",
        "time": "2018-08-12T10:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "Are you a malware developer for Android devices? We have very bad news for you: the Android-SDK packager (aapt) is leaking your time zone! We have found a bug inside this Android-SDK's component that relies in not properly setting the value of a variable used as an argument for localtime() function, when setting the \"Last Modified\" field for the Android App's files. Because of this, the time zone of anyone using the Android-SDK packager to generate their APKs is leaked. The curious thing is that, despite of this bug inside aapt, the problem goes even beyond aapt itself: its roots goes deep into an incorrect handling errors in the operative system functions localtime() (Windows) and localtime_r() (UNIX). Because of in the world of Threat Intelligence determining the attacker's geographical location of is one of the most valuable data for attribution techniques, we focused our research in taking advantage of this bug for tracking Android malware developers. In addition to this, we have discovered another very effective way to find out the developer's time zone, based on a calculation of times extracting the GMT timestamp from the Android's app files and the UTC timestamp of the self-signed,\"disposable\" certificate added to the application (most common cases in malware developers). This is what we call: Rock appround the clock! Using these two different techniques, we have crunched some numbers with our 10 million apps database to determine how these leaked time zones (with one or another technique) are related with malware and which are the countries that generate more Android malicious applications, what is the possible relation between time zone and\"malware likelihood\" among other interesting numbers. But that's not all, we have another bad news for malware developers: no IDE (even Android Studio) removes metadata from the files added to the Android app. We will show examples with real cases in which, after analyzing the metadata of files inside the .apk, we got to know country, language, or even more specific geographical location of the developer and -in some cases- the name of the suppose-to-be-anonymous developer! Finally, we will share the scripts we have built to get all this information with just a simple click."
    },
    {
        "title": "Ring 0/-2 Rootkits: bypassing defenses",
        "speaker": "Ring 0/-2 Rootkits: bypassing defenses",
        "time": "2018-08-09T12:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "Advanced malware such as TDL4, Rovnix, Gapz, Omasco, Mebromi and others have exposed in recent years various techniques used to circumvent the usual defenses and have shown how much companies are not prepared to deal with these sophisticated threats. Although the industry has implemented new protections such as Virtualized Based Security, Windows SMM Security Mitigation Table (WSMT), Kernel Code Signing, HVCI, ELAM, Secure Boot, Boot Guard, BIOS Guard, and many others, it is still unknown the professionals of the architecture of these protections, what are the components attacked by these contemporary malwares in the context of BIOS / UEFI and what are the tricks used by them. Precisely because of the lack of adequate understanding, most machines (BIOS / UEFI + operating system) remain vulnerable in the same way as a few years ago. In addition, there are a growing number of malwares that have used kernel drivers to circumvent limitations and protections in order to gain full access to the operating system and data. Exactly for these reasons, it is necessary to understand the way that malwares act as device drivers and what are the mechanisms used by these threats to infect an operating system. The purpose of this presentation is to show clearly and without too much details that often hinders understanding, how these threats act, which components are attacked, what are the techniques used by these advanced malware to subvert the system and how existing protections work ."
    },
    {
        "title": "Trouble in the tubes: How internet routing security breaks down and how you can do it at home",
        "speaker": "Trouble in the tubes: How internet routing security breaks down and how you can do it at home",
        "time": "2018-08-12T13:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "We all protect our home networks, but how safe is your data once it leaves on its journey to the latest cat pictures? How does your traffic make it to its destination and what threats does it face on its way? What is BGP and why should you care? \n\t\nIn this talk, I'll explain the basic structure of the network that is the Internet and the trust relationships on which it is built.  We'll explore several types of attacks that you may have seen in the news that exploit this relationship to bring down websites, steal cryptocurrency, and monitor dissidents. \n\t\nBecause talking about bringing down the Internet isn't as much fun as doing, I'll show how to create a mini Internet using Mininet and demonstrate the attacks without the need for a BGP router or a lawyer. Finally, because nation states shouldn't get to have all the fun, I'll use Scapy and some novel techniques to demonstrate how a compromised router can be used to prevent attribution, frame a friend, or create a covert communication channel."
    },
    {
        "title": "Last mile authentication problem: Exploiting the missing link in end-to-end secure communication",
        "speaker": "Last mile authentication problem: Exploiting the missing link in end-to-end secure communication",
        "time": "2018-08-12T12:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "With \"Trust none over the Internet\" mindset, securing all communication between a client and a server with protocols such as TLS has become a common practice. However, while the communication over Internet is routinely secured, there is still an area where such security awareness is not seen: inside individual computers, where adversaries are often not expected. This talk discusses the security of various inter-process communication (IPC) mechanisms that local processes and applications use to interact with each other. In particular, we show IPC-related vulnerabilities that allow a non-privileged process to steal passwords stored in popular password managers and even second factors from hardware tokens. With passwords being the primary way of authentication, the insecurity of this \"last mile\" causes the security of the rest of the communication strands to be obsolete. The vulnerabilities that we demonstrate can be exploited on multi-user computers that may have processes of multiple users running at the same time. The attacker is a non-privileged user trying to steal sensitive information from other users. Such computers can be found in enterprises with centralized access control that gives multiple users access to the same host. Computers with guest accounts and shared computers at home are similarly vulnerable."
    },
    {
        "title": "Reverse Engineering Windows Defender's Emulator",
        "speaker": "Reverse Engineering Windows Defender's Emulator",
        "time": "2018-08-11T15:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "Windows Defender Antivirus's mpengine.dll implements the core of Defender's functionality in an enormous ~11 MB, 30,000+ function DLL. In this presentation, we'll look at Defender's emulator for analysis of potentially malicious Windows binaries on the endpoint. To the best of my knowledge, there has never been a conference talk or publication on reverse engineering any antivirus binary emulator before. We'll cover a range of topics including emulator internals—machine code to intermediate language translation and execution; memory management; Windows API emulation; NT kernel emulation; file system and registry emulation; integration with Defender's antivirus features; the virtual environment; etc.—building custom tooling for instrumenting the emulator; tricks that binaries can use to evade or subvert analysis; and attack surface within the emulator. Attendees will leave with an understanding of how modern antivirus software conducts emulation-based dynamic analysis on the endpoint, and how attackers might go about subverting or attacking these systems. I'll publish code for a binary for exploring the emulator from within, patches that I developed for instrumenting Defender built on top of Tavis Ormandy's loadlibrary project, and IDA scripts to help with analyzing mpengine.dll and Defender's \"VDLLs\""
    },
    {
        "title": "A Journey Into Hexagon: Dissecting a Qualcomm Baseband",
        "speaker": "A Journey Into Hexagon: Dissecting a Qualcomm Baseband",
        "time": "2018-08-09T13:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "Mobile phones are quite complicated and feature multiple embedded processors handling wifi, cellular connectivity, bluetooth, and other signal processing in addition to the application processor. Have you ever been curious about how your phone actually makes calls and texts on a low level? Or maybe you want to learn more about the internals of the baseband but have no clue where to start. We will dive into the internals of a qualcomm baseband, tracing it's evolution over the years until its current state. We will discuss the custom, in-house DSP architecture they now run on, and the proprietary RTOS running on it. We will also cover the architecture of the cellular stack, likely places vulnerabilities lie, and exploit mitigations in place. Finally we will cover debugging possibilities, and how to get started analyzing the baseband firmware—how to differentiate between RTOS and cellular functions, how to find C std library functions, and more."
    },
    {
        "title": "Relocation Bonus: Attacking the Windows Loader Makes Analysts Switch Careers",
        "speaker": "Relocation Bonus: Attacking the Windows Loader Makes Analysts Switch Careers",
        "time": "2018-08-11T17:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "The arbiters of defense wield many static analysis tools; disassemblers, PE viewers, and anti-viruses are among them. When you peer into their minds, these tools reveal their perilous implementations of PE file parsing. They assume PE files come as-is, but the Windows Loader actually applies many mutations (some at the command of the PE itself) before execution ever begins. This talk is about bending that loader to one's whim with the Relocations Table as a command spell. It will demonstrate how the loader can be instrumented into a mutation engine capable of transforming an utterly mangled PE file into a valid executable. This method starts with multiple ASLR Preselection attacks that force binary mapping at a predictable address. It then mangles the PE file, garbling any byte not required prior to relocation. Finally, it embeds a new Relocations Table which, when paired with a preselected base address, causes the loader to reconstruct the PE and execute it with ease. This isn't a packer or a POC, it is a PE rebuilder which generates completely valid, stable, and vastly tool-breaking executables. This talk will show you how this attack twists the protocols of a machine against the controls meant to protect it. It flexes on tools with various look-what-I-can-break demonstrations and, if you write similar tools, it'll make you rethink how you do it."
    },
    {
        "title": "Project Interceptor: avoiding counter-drone systems with nanodrones",
        "speaker": "Project Interceptor: avoiding counter-drone systems with nanodrones",
        "time": "2018-08-11T15:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "Antidrone system industries have arised. Due to several, and even classic, vulnerabilities in communication systems now used by drones , anti-drone systems are able to take down those drone by means of well documented attacks. Drone/antidrone competition has already been set into the scene. This talk provides a new vision about drone protection against anti-drone systems, presenting \"The Interceptor Project\", a hand-sized nano drone based on single-core tiniest Linux Board: Vocore2. This Linux board manages a WiFi (side/hidden) bidirectional channel communication that cannot be deauthenticated and it is replay-resistant, keeping all 802.11 hacking capabilities and standard utilities as any other WiFi hacker drone, with only the built-in adapter of the tiny Vocore2. Also, a \"just in case\", fallback control by SDR is implemented taking advantage of all the goods that SDR radio gives.  All embedded into a hand-sized aircraft to make detection and mitigation a real and new pain, with a very low budget: About $70."
    },
    {
        "title": "You'd better secure your BLE devices or we'll kick your butts !",
        "speaker": "You'd better secure your BLE devices or we'll kick your butts !",
        "time": "2018-08-11T12:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "Sniffing and attacking Bluetooth Low Energy devices has always been a real pain. Proprietary tools do the job but cannot be tuned to fit our offensive needs, while opensource tools work sometimes, but are not reliable and efficient. Even the recently released Man-in-the-Middle BLE attack tools have their limits, like their complexity and lack of features to analyze encrypted or short connections. Furthermore, as vendors do not seem inclined to improve the security of their devices by following the best practices, we decided to create a tool to lower the ticket: BtleJack. BtleJack not only provides an affordable and reliable way to sniff and analyze Bluetooth Low Energy devices and their protocol stacks, but also implements a brand new attack dubbed \"BtleJacking\" that provides a way to take control of any already connected BLE device. We will demonstrate how this attack works on various devices, how to protect them and avoid hijacking and of course release the source code of the tool. Vendors, be warned: BLE hijacking is real and should be considered in your threat model."
    },
    {
        "title": "Building the Hacker Tracker",
        "speaker": "Building the Hacker Tracker",
        "time": "2018-08-09T15:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "20 minutes",
        "abstract": "In 2012, back when DEF CON still fit in the Riviera (RIP), I recognized a gap to fill. I wanted to create a mobile version of the paper DEF CON booklet that everyone could use at the con. I was unable to attend the conference that year. I was 8 months pregnant with my first child, and because I couldn't be there in person, I spent a lot of time wishing I was. So I built it. I spent countless hours pouring my heart into what became the Hacker Tracker, shiny graphics and all, and was committing code up until the minute I went into labor. Fast forward a few years: Seth was frustrated with the lack of a mobile app for iOS while attending DEF CON. Subsequently, he found the Android version of Hacker Tracker and reached out to me about creating an iOS version. I was thrilled that someone wanted to join me and help grow the project. Not long after that, I recruited Chris to work on the app as well. Now, 6 years since its inception, a small team supports the app development across iOS and Android and the apps are being used by half a dozen different conferences, representing several thousand users. From nothing to something, we've experienced quite a bit in 6 years. Join us as we share our moments of joy, fear, and panic,\"things not to do\", and more."
    },
    {
        "title": "DEF CON Closing Ceremonies",
        "speaker": "DEF CON Closing Ceremonies",
        "time": "2018-08-12T16:00:00.000Z",
        "location": "Track 1",
        "duration": "105 minutes",
        "abstract": "DEF CON Closing Ceremonies"
    },
    {
        "title": "Outsmarting the Smart City",
        "speaker": "Outsmarting the Smart City",
        "time": "2018-08-11T16:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "The term\"smart city\" evokes imagery of flying cars, shop windows that double as informational touchscreens, and other retro-futuristic fantasies of what the future may hold. Stepping away from the smart city fantasy, the reality is actually much more mundane. Many of these technologies have already quietly been deployed in cities across the world. In this talk, we examine the security of a cross-section of smart city devices currently in use today to reveal how deeply flawed they are and how the implications of these vulnerabilities could have serious consequences. In addition to discussing newly discovered pre-auth attacks against multiple smart city devices from different categories of smart city technology, this presentation will discuss methods for how to figure out what smart city tech a given city is using, the privacy implications of smart cities, the implications of successful attacks on smart city tech, and what the future of smart city tech may hold."
    },
    {
        "title": "DEF CON 101 Panel",
        "speaker": "DEF CON 101 Panel",
        "time": "2018-08-09T15:30:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "105 minutes",
        "abstract": "Ten years ago, DEF CON 101 was founded by HighWiz as a way to introduce n00bs to DEF CON.  The idea was to help attendees get the best experience out of DEF CON (and also tell them how to survive the weekend!).  The DEF CON 101 panel has been a way for people who have participated in making DEF CON what it is today to share those experiences and, hopefully, inspire attendees to expand their horizons.  DEF CON offers so much more than just talks and the DEF CON 101 panel is the perfect place to learn about all things DEF CON so you, dear reader, can  get the best experience possible.  The panel will end with the time honored tradition of \"Name the n00b\" where lucky attendees will be brought up on stage to introduce themselves to you and earn the coveted 101 n00b handle.  Don't worry if you don't make it on to the stage, there will be plenty of other prizes for you to enjoy!"
    },
    {
        "title": "Your Bank's Digital Side Door",
        "speaker": "Your Bank's Digital Side Door",
        "time": "2018-08-10T17:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "Why does my bank's website require my MFA token but Quicken sync does not? How is using Quicken or any personal financial software different from using my bank's website? How are they communicating with my bank? These questions ran through my head when balancing the family checkbook every month. Answering these questions led me to deeply explore the 20 year old Open Financial Exchange (OFX) protocol and the over 3000 North American banks that support it. They led me to the over 30 different implementations running in the wild and to a broad and inviting attack surface presented by these banks' digital side doors. Now I'd like to guide you through how your Quicken, QuickBooks, Mint.com, or even GnuCash applications are gathering your checking account transactions, credit card purchases, stock portfolio, and tax documents. We'll watch them flow over the wire and learn about the jumble of software your bank's IT department deploys to provide them. We'll discuss how secure these systems are, that keep track of your money, and we'll send a few simple packets at several banks and count the number of security WTFs along the way. Lastly, I'll demo and release a tool that fingerprints an OFX service, describes its capabilities, and assesses its security."
    },
    {
        "title": "PANEL: DEF CON GROUPS",
        "speaker": "PANEL: DEF CON GROUPS",
        "time": "2018-08-12T15:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "Do you love DEF CON? Do you hate having to wait for it all year? Well, thanks to DEF CON groups, you're able to carry the spirit of DEF CON with you year round, and with local people, transcending borders, languages, and anything else that may separate us!In this special event, your DEF CON groups team who works behind the scenes to make DCG possible will introduce themselves and provide status updates. After we're done talking, the remainder of time will be an informal open floor right there in the room to mingle and talk all things DCG.There will be a:Designated area in the room for those wanting to start/join a groupDesignated area in the room for those wanting to share project ideas"
    },
    {
        "title": "Your Voice is My Passport",
        "speaker": "Your Voice is My Passport",
        "time": "2018-08-10T16:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "Financial institutions, home automation products, and offices near universal cryptographic decoders have increasingly used voice fingerprinting as a method for authentication. Recent advances in machine learning and text-to-speech have shown that synthetic, high-quality audio of subjects can be generated using transcripted speech from the target. Are current techniques for audio generation enough to spoof voice authentication algorithms? We demonstrate, using freely available machine learning models and limited budget, that standard speaker recognition and voice authentication systems are indeed fooled by targeted text-to-speech attacks. We further show a method which reduces data required to perform such an attack, demonstrating that more people are at risk for voice impersonation than previously thought."
    },
    {
        "title": "The ring 0 façade: awakening the processor's inner demons",
        "speaker": "The ring 0 façade: awakening the processor's inner demons",
        "time": "2018-08-11T13:30:00.000Z",
        "location": "Track 1",
        "duration": "20 minutes",
        "abstract": "Your computer is not yours. You may have shelled out thousands of dollars for it.  It may be sitting right there on your desk.  You may have carved your name deep into its side with a blowtorch and chisel. But it's still not yours. Some vendors are building secret processor registers into your system's hardware, only accessible by shadowy third parties with trusted keys. We as the end users are being intentionally locked out and left in the dark, unable to access the heart of our own processors, while select organizations are granted full control of the internals of our CPUs. In this talk, we'll demonstrate our work on how to probe for and unlock these previously invisible secret registers, to break into all-powerful features buried deep within the processor core, to finally take back our own computers."
    },
    {
        "title": "GOD MODE UNLOCKED: Hardware Backdoors in [redacted] x86 CPUs",
        "speaker": "GOD MODE UNLOCKED: Hardware Backdoors in [redacted] x86 CPUs",
        "time": "2018-08-10T14:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "Complexity is increasing. Trust eroding. In the wake of Spectre and Meltdown, when it seems that things cannot get any darker for processor security, the last light goes out. This talk will demonstrate what everyone has long feared but never proven: there are hardware backdoors in some x86 processors, and they're buried deeper than we ever imagined possible. While this research specifically examines a third-party processor, we use this as a stepping stone to explore the feasibility of more widespread hardware backdoors."
    },
    {
        "title": "One-liners to Rule Them All",
        "speaker": "One-liners to Rule Them All",
        "time": "2018-08-10T11:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": " It began with the forging of the command line. And some things that should not have been forgotten, were lost. History became legend, legend became myth.   Sometimes you just need to pull out the third column of a CSV file. Sometimes you just need to sort IP addresses. Sometimes you have to pull out IP addresses from the third column and sort them, but only if the first column is a particular string and for some reason the case is random.   In this DEF CON 101 talk, we'll cover a ton of bash one-liners that we use to speed up our hacking. Along the way, we'll talk about the concepts behind each of them and how we apply various strategies to accomplish whatever weird data processing task comes up while testing exploits and attacking a network."
    },
    {
        "title": "Lost and Found Certificates: dealing with residual certificates for pre-owned domains",
        "speaker": "Lost and Found Certificates: dealing with residual certificates for pre-owned domains",
        "time": "2018-08-12T13:30:00.000Z",
        "location": "Track 2",
        "duration": "20 minutes",
        "abstract": "When purchasing a new domain name you would expect that you are the only one who can obtain a valid SSL certificate for it, however that is not always the case. When the domain had a prior owner(s), even several years prior, they may still possess a valid SSL certificate for it and there is very little you can do about it. Using Certificate Transparency, we examined millions of domains and certificates and found thousands of examples where the previous owner for a domain still possessed a valid SSL certificate for the domain long after it changed ownership. We will review the results from our ongoing large scale quantitative analysis over past and current domains and certificates. We'll explore the massive scale of the problem, what we can do about it, how you can protect yourself, and a proposed process change to make this less of a problem going forwards. We end by introducing BygoneSSL, a new tool and dashboard that shows an up to date view of affected domains and certificates using publicly available DNS data and Certificate Transparency logs. BygoneSSL will demonstrate how widespread the issue is, let domain owners determine if they could be affected, and can be used to track the number of affected domains over time."
    },
    {
        "title": "Defending the 2018 Midterm Elections from Foreign Adversaries ",
        "speaker": "Defending the 2018 Midterm Elections from Foreign Adversaries ",
        "time": "2018-08-12T10:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "Election Buster is an open source tool created in 2014 to identify malicious domains masquerading as candidate webpages and voter registration systems. During 2016, fake domains were used to compromise credentials of a Democratic National Committee (DNC) IT services company, and foreign adversaries probed voter registration systems. The tool now cross-checks domain information against open source threat intelligence feeds, and uses a semi-autonomous scheme for identifying phundraising and false flag sites via ensembled data mining and deep learning techniques. We identified Russian nationals registering fake campaign sites, candidates deploying defensive—and offensive—measures against their opponents, and candidates unintentionally exposing sensitive PII to the public. This talk provides an analysis of our 2016 Presidential Election data, and all data recently collected during the 2018 midterm elections. The talk also details technological and procedural measures that government offices and campaigns can use to defend themselves."
    },
    {
        "title": "For the Love of Money: Finding and exploiting vulnerabilities in mobile point of sales systems",
        "speaker": "For the Love of Money: Finding and exploiting vulnerabilities in mobile point of sales systems",
        "time": "2018-08-12T10:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "These days it's hard to find a business that doesn't accept faster payments. Mobile Point of Sales (mPOS) terminals have propelled this growth lowering the barriers for small and micro-sized businesses to accept non-cash payments. Older payment technologies like mag-stripe still account for the largest majority of all in-person transactions. This is complicated further by the introduction of new payment standards such as NFC. As with each new iteration in payment technology, inevitably weaknesses are introduced into this increasingly complex payment eco-system. In this talk, we ask, what are the security and fraud implications of removing the economic barriers to accepting card payments; and what are the risks associated with continued reliance on old card standards like mag-stripe? In the past, testing for payment attack vectors has been limited to the scope of individual projects and to those that have permanent access to POS and payment infrastructure. Not anymore! In what we believe to be the most comprehensive research conducted in this area, we consider four of the major mPOS providers spread across the US and Europe; Square, SumUp, iZettle and Paypal. We provide live demonstrations of new vulnerabilities that allow you to MitM transactions, send arbitrary code via Bluetooth and mobile application, modify payment values for mag-stripe transactions, and a vulnerability in firmware; DoS to RCE. Using this sampled geographic approach, we are able to show the current attack surface of mPOS and, to predict how this will evolve over the coming years. For audience members that are interested in integrating testing practices into their organization or research practices, we will show you how to use mPOS to identify weaknesses in payment technologies, and how to remain undetected in spite of anti-fraud and security mechanisms."
    },
    {
        "title": "It's Assembler, Jim, but not as we know it: (ab)using binaries from embedded devices for fun and profit",
        "speaker": "It's Assembler, Jim, but not as we know it: (ab)using binaries from embedded devices for fun and profit",
        "time": "2018-08-10T12:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "With the proliferation of Linux-based SoCs -- you've likely got one or two in your house, on your person or in your pocket -- it is often useful to look \"under the hood\" at what is running; Additionally, in-situ debugging may be unavailable due to read-only filesystems, memory is often limited, and other factors keep us from attacking a live device. This talk looks at attacking binaries outside their native environment using QEMU, the Quick Emulator, as well as techniques for extracting relevant content from devices and exploring them."
    },
    {
        "title": "Playback: a TLS 1.3 story",
        "speaker": "Playback: a TLS 1.3 story",
        "time": "2018-08-10T15:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "TLS 1.3 is the new secure communication protocol that should be already with us. One of its new features is 0-RTT (Zero Round Trip Time Resumption) that could potentially allow replay attacks. This is a known issue acknowledged by the TLS 1.3 specification, as the protocol does not provide replay protections for 0-RTT data, but proposed countermeasures that would need to be implemented on other layers, not at the protocol level. Therefore, the applications deployed with TLS 1.3 support could end up exposed to replay attacks depending on the implementation of those protections.       This talk will describe the technical details regarding the TLS 1.3 0-RTT feature and its associated risks. It will include Proof of Concepts (PoC) showing real-world replay attacks against TLS 1.3 libraries and browsers. Finally, potential solutions or mitigation controls would be discussed that will help to prevent those attacks when deploying software using a library with TLS 1.3 support."
    },
    {
        "title": "Having fun with IoT: Reverse Engineering and Hacking of Xiaomi IoT Devices",
        "speaker": "Having fun with IoT: Reverse Engineering and Hacking of Xiaomi IoT Devices",
        "time": "2018-08-11T14:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "While most IoT accessory manufacturers have a narrow area of focus, Xiaomi, an Asian based vendor, controls a vast IoT ecosystem, including smart lightbulbs, sensors, cameras, vacuum cleaners, network speakers, electric scooters and even washing machines. In addition, Xiaomi also manufactures smartphones. Their products are sold not only in Asia, but also in Europe and North America. The company claims to have the biggest IoT platform worldwide.\n\nIn my talk, I will give a brief overview of the most common, Wi-Fi based, Xiaomi IoT devices. Their devices may have a deep integration in the daily life (like vacuum cleaners, smart toilet seats, cameras, sensors, lights).\n\nI will focus on the features, computational power, sensors, security and ability to root the devices. Let’s explore how you can have fun with the devices or use them for something useful, like mapping Wi-Fi signal strength while vacuuming your house. I will also cover some interesting things I discovered while reverse engineering Xiaomi's devices and discuss which protections were deployed by the developers (and which not).\n\nBe prepared to see the guts of many of these devices. We will exploit them and use them to exploit other devices."
    },
    {
        "title": "Pwning \"the toughest target\": the exploit chain of winning the largest bug bounty in the history of ASR program",
        "speaker": "Pwning \"the toughest target\": the exploit chain of winning the largest bug bounty in the history of ASR program",
        "time": "2018-08-09T11:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "In recent years, Google has made many great efforts in exploit mitigation and attack surface reduction to strengthen the security of android system. It is becoming more and more difficult to remotely compromise Android phones especially Google’s Pixel phone.\n\nThe Pixel phone is protected by many layers of security. It was the only device that was not pwned in the 2017 Mobile Pwn2Own competition. But our team discovered a remote exploit chain—the first of its kind since the Android Security Rewards (ASR) program expansion, which could compromise The Pixel phone remotely. The exploit chain was reported to Android security team directly. They took it seriously and patched it quickly. Because of the severity and our detailed report, we were awarded the highest reward ($112,500) in the history of the ASR program.\n\nIn this talk we will detail how we used the exploit chain to inject arbitrary code into system_server process and get system user permissions. The exploit chain includes two bugs, CVE-2017-5116 and CVE-2017-14904. CVE-2017-5116 is a V8 engine bug related with Webassembly and SharedArrayBuffer. It is used to get remote code execution in sandboxed Chrome render process. CVE-2017-14904 is a bug in Android's libgralloc module that is used to escape from the sandbox. The way we used for sandbox escaping is very interesting, rarely talked about before. All details of vulnerabilities and mitigation bypassing techniques will be given in this talk."
    },
    {
        "title": "De-anonymizing Programmers from Source Code and Binaries",
        "speaker": "De-anonymizing Programmers from Source Code and Binaries",
        "time": "2018-08-10T10:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "Many hackers like to contribute code, binaries, and exploits under pseudonyms, but how anonymous are these contributions really? In this talk, we will discuss our work on programmer de-anonymization from the standpoint of machine learning. We will show how abstract syntax trees contain stylistic fingerprints and how these can be used to potentially identify programmers from code and binaries. We perform programmer de-anonymization using both obfuscated binaries, and real-world code found in single-author GitHub repositories and the leaked Nulled.IO hacker forum."
    },
    {
        "title": "Automated Discovery of Deserialization Gadget Chains",
        "speaker": "Automated Discovery of Deserialization Gadget Chains",
        "time": "2018-08-10T16:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "Although vulnerabilities stemming from the deserialization of untrusted data have been understood for many years, unsafe deserialization continues to be a vulnerability class that isn't going away. Attention on Java deserialization vulnerabilities skyrocketed in 2015 when Frohoff and Lawrence published an RCE gadget chain in the Apache Commons library and as recently as last year's Black Hat, Muñoz and Miroshis presented a survey of dangerous JSON deserialization libraries. While much research and automated detection technology has so far focused on the discovery of vulnerable entry points (i.e. code that deserializes untrusted data), finding a \"gadget chain\" to actually make the vulnerability exploitable has thus far been a largely manual exercise. In this talk, I present a new technique for the automated discovery of deserialization gadget chains in Java, allowing defensive teams to quickly identify the significance of a deserialization vulnerability and allowing penetration testers to quickly develop working exploits. At the conclusion we will also be releasing a FOSS toolkit which utilizes this methodology and has been used to successfully develop many deserialization exploits in both internal applications and open source projects."
    },
    {
        "title": "4G—Who is paying your cellular phone bill?",
        "speaker": "4G—Who is paying your cellular phone bill?",
        "time": "2018-08-10T14:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "Cellular networks are connected with each other through a worldwide private, but not unaccessible network, called IPX network. Through this network user related information is exchanged for roaming purposes or for cross-network communication. This private network has been breached by criminals and nation states. Cellular networks are extremely complex and many attacks have been already been found e.g. DoS, location tracking, SMS interception, data interception. Many attacks have been seen in practice, but not all attack are understood and not all attack avenues using the IPX network have been explored. This presentation shows how a S9 interface in 4G networks, which is used for charging related user information exchange between operators can be exploited to perform fraud attacks. A demonstration with technical details will be given and guidance on practical countermeasures."
    },
    {
        "title": " Breaking Smart Speakers: We are Listening to You.",
        "speaker": " Breaking Smart Speakers: We are Listening to You.",
        "time": "2018-08-12T12:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "In the past two years, smart speakers have become the most popular IoT device, Amazon_ Google and Apple have introduced their own smart speaker products. Most of these smart speakers have natural language recognition, chat, music playback, IoT device control, shopping, and so on. Manufacturers use artificial intelligence technology to make smart speakers have similar human capabilities in the chat conversation. However, with the smart speakers coming into more and more homes, and the function is becoming more powerful, its security has been questioned by many people. People are worried that smart speakers will be hacked to leak their privacy, and our research proves that this concern is very necessary.In this talk, we will present how to use multiple vulnerabilities to achieve remote attack some of the most popular smart speakers. Our final attack effects include silent listening, control speaker speaking content and other demonstrations. And we're also going to talk about how to extract firmware from BGA packages Flash chips such as EMMC, EMCP, NAND Flash, etc. In addition, it contains how to turn on debug interfaces and get root privileges by modifying firmware content and Re-soldering Flash chips, which can be of great help for subsequent vulnerability analysis and debugging. Finally, we will play several demo videos to demonstrate how we can remotely access some Smart Speaker Root permissions and use smart speakers for eavesdropping and playing voice."
    },
    {
        "title": "Edge Side Include Injection: Abusing Caching Servers into SSRF and Transparent Session Hijacking",
        "speaker": "Edge Side Include Injection: Abusing Caching Servers into SSRF and Transparent Session Hijacking",
        "time": "2018-08-12T13:30:00.000Z",
        "location": "Track 3",
        "duration": "20 minutes",
        "abstract": "When caching servers and load balancers became an integral part of the Internet's infrastructure, vendors introduced \"Edge Side Includes\" (ESI), a technology allowing malleability in caching systems. This legacy technology, still implemented in nearly all popular HTTP surrogates (caching/load balancing services), is dangerous by design and brings a yet unexplored vector for web-based attacks. The ESI language consists of a small set of instructions represented by XML tags, served by the backend application server, which are processed on the Edge servers (load balancers, reverse proxies). Due to the upstream-trusting nature of Edge servers, ESI engines are not able to distinguish between ESI instructions legitimately provided by the application server and malicious instructions injected by a malicious party. We identified that ESI can be used to perform SSRF, bypass reflected XSS filters (Chrome), and perform Javascript-less cookie theft, including HTTPOnly cookies. Identified affected vendors include Akamai, Varnish, Squid, Fastly, WebSphere, WebLogic, F5, and countless language-specific solutions (NodeJS, Ruby, etc.). This presentation will start by introducing ESI and visiting typical infrastructures leveraging it. We will then delve into identification, exploitation of popular ESI engines, and mitigation."
    },
    {
        "title": "Digital Leviathan: a comprehensive list of Nation-State Big Brothers (from huge to little ones",
        "speaker": "Digital Leviathan: a comprehensive list of Nation-State Big Brothers (from huge to little ones",
        "time": "2018-08-11T14:00:00.000Z",
        "location": "Track 2",
        "duration": "20 minutes",
        "abstract": "In his notorious book Leviathan, the XVII century English philosopher Thomas Hobbes stated that: we should give our obedience to an unaccountable sovereign otherwise what awaits us is a state of nature that closely resembles civil war—a situation of universal insecurity. It looks like a lot of current political leaders have red and found the teachings of Hobbes applicable to modern day online life.We witness the rise of the Digital Leviathan. The same apps and applications that people use to connect, express opinions and dissatisfaction are used by governments (even democratic ones) to perform surveillance and censorship.This talk will focus on evidence of Nation-State spying, performing surveillance, and censorship. The aim is to present a systematical approach of data regarding cyber attacks against political targets (NGO/political groups/media outlets/opposition), acquisition and/or use of spywares from private vendors, requested content/metadata from social media/content providers, and blocking of websites/censorship reported by multiple sources.The findings of the research imply that: - 25 nations that have already used cyber offensive capabilities against political targets. - 60 nations acquired/developed spyware.- 117 nations requested content/metadata from social media/content providers.- 21 countries perform some level of censorship to online content."
    },
    {
        "title": "Vulnerable Out of the Box: An Evaluation of Android Carrier Devices",
        "speaker": "Vulnerable Out of the Box: An Evaluation of Android Carrier Devices",
        "time": "2018-08-10T12:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "Pre-installed apps and firmware pose a risk due to vulnerabilities that can be pre-positioned on a device, rendering the device vulnerable on purchase. This means that the vulnerabilities are present even before the user enables wireless communications and starts installing third-party apps. To quantify the exposure of the Android end-users to vulnerabilities residing within pre-installed apps and firmware, we analyzed a wide range of Android vendors and carriers using devices spanning from low-end to flagship. Our primary focus was exposing pre-positioned threats on Android devices sold by United States (US) carriers, although our results affect devices worldwide. We will provide details of vulnerabilities in devices from all four major US carriers, as well two smaller US carriers, among others. The vulnerabilities we discovered on devices offered by the major US carriers are the following: arbitrary command execution as the system user, obtaining the modem logs and logcat logs, wiping all user data from a device (i.e., factory reset), obtaining and modifying a user’s text messages, sending arbitrary text messages, and getting the phone numbers of the user’s contacts, and more. All of the aforementioned capabilities are obtained outside of the normal Android permission model. Including both locked and unlocked devices, we provide details for 37 unique vulnerabilities affecting 25 Android devices with 11 of them being sold by US carriers. In this talk, we will present our framework that is capable of discovering 0-day vulnerabilities from binary firmware images and applications at scale allowing us to continuously monitor devices across different manufacturers and firmware versions. During the talk, we plan to perform a live demo of how our system works."
    },
    {
        "title": "TBA",
        "speaker": "TBA",
        "time": "2018-08-10T11:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": ""
    },
    {
        "title": "Dragnet—Your Social Engineering Sidekick",
        "speaker": "Dragnet—Your Social Engineering Sidekick",
        "time": "2018-08-10T13:30:00.000Z",
        "location": "Track 1",
        "duration": "20 minutes",
        "abstract": "First, Dragnet collects dozens of OSINT data points on past and present social engineering targets. Then, using conversion data from previous engagements, Dragnet provides recommendations for use on your current targets: phishing templates, vishing scripts and physical pretexts- all to increase conversions with minimal effort. Finally, features like landing page cloning and domain registration (alongside your standard infrastructure deployment, call scheduling and email delivery) make Dragnet one hell of a catch."
    },
    {
        "title": "Your Watch Can Watch You! Gear Up for the Broken Privilege Pitfalls in the Samsung Gear Smartwatch",
        "speaker": "Your Watch Can Watch You! Gear Up for the Broken Privilege Pitfalls in the Samsung Gear Smartwatch",
        "time": "2018-08-12T14:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "You buy a brand-new smartwatch. You receive emails and send messages, right on your wrist. How convenient, this mighty power! But great power always comes with great responsibility. Smartwatches hold precious information just like smartphones, so do they actually fulfill their responsibilities?\n\nIn this talk, we will investigate if the Samsung Gear smartwatch series properly screens unauthorized access to user information. More specifically, we will focus on a communication channel between applications and system services, and how each internal Tizen OS components play the parts in access control.\n\nBased on the analysis, we have developed a new simple tool to discover privilege violations in Tizen-based products. We will present an analysis on the Gear smartwatch which turns out to include a number of vulnerabilities in system services.\n\nWe will disclose several previously unknown exploits in this presentation. They enable an unprivileged application to take over the wireless services, the user’s email account, and more. Further discussions will center on the distribution of those exploits through a registered application in the market, and the causes of the vulnerabilities in detail."
    },
    {
        "title": "Micro-Renovator: Bringing Processor Firmware up to Code",
        "speaker": "Micro-Renovator: Bringing Processor Firmware up to Code",
        "time": "2018-08-12T13:00:00.000Z",
        "location": "Track 2",
        "duration": "20 minutes",
        "abstract": "The mitigations for Spectre highlighted a weak link in the patching process for many users: firmware (un)availability. While updated microcode was made publicly available for many processors, end-users are unable to directly consume it. Instead, platform and operating system vendors need to distribute firmware and kernel patches which include the new microcode. Inconsistent support from those vendors has left millions of users without a way to consume these critical security updates, until now. Micro-Renovator provides the ability to apply microcode updates without modifying either platform firmware or the operating system, through simple (and reversible) modifications to the EFI boot partition."
    },
    {
        "title": "Searching for the Light: Adventures with OpticSpy",
        "speaker": "Searching for the Light: Adventures with OpticSpy",
        "time": "2018-08-12T11:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "In the counter-future where we, the dissidents and hackers, have control of technology, sending secret messages through blinkenlights can let us exchange information without being detected by dystopian leaders. By modulating light in a way that the human eye cannot see, this simple, yet clever, covert channel lets us hide in plain sight. To decode such transmissions, we must employ some sort of optical receiver.\n\nEnter OpticSpy, an open source hardware module that captures, amplifies, and converts an optical signal from a visible or infrared light source into a digital form that can be analyzed or decoded with a computer. This presentation provides a brief history of covert channels and optical communications, explores the development process and operational details of OpticSpy, and gives a variety of demonstrations of the unit in action."
    },
    {
        "title": "Designing and Applying Extensible RF Fuzzing Tools to Expose PHY Layer Vulnerabilities",
        "speaker": "Designing and Applying Extensible RF Fuzzing Tools to Expose PHY Layer Vulnerabilities",
        "time": "2018-08-12T12:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "In this session, we introduce an open source hardware and software framework for fuzzing arbitrary RF protocols, all the way down to the PHY.  While fuzzing has long been relied on by security researchers to identify software bugs, applying fuzzing methodologies to RF and hardware systems has historically been challenging due to siloed tools and the limited capabilities of commodity RF chipsets.\n\nWe created the TumbleRF fuzzing orchestration framework to address these shortfalls by defining core fuzzing logic while abstracting a hardware interface API that can be mapped for compatibility with any RF driver.  Thus, supporting a new radio involves merely extending an API, rather than writing a protocol-specific fuzzer from scratch.\n\nAdditionally, we introduce Orthrus, a low-cost 2.4 GHz offensive radio tool that provides PHY-layer mutability to offer Software Defined Radio-like features in a flexible and low-latency embedded form factor.  By combining the two, researchers will be able to fuzz and test RF protocols with greater depth and precision than ever before.\n\nAttendees can expect to leave this talk with an understanding of how RF and hardware physical layers actually work, and how to identify security issues that lie latent in these designs."
    },
    {
        "title": "Through the Eyes of the Attacker: Designing Embedded Systems Exploits for Industrial Control Systems",
        "speaker": "Through the Eyes of the Attacker: Designing Embedded Systems Exploits for Industrial Control Systems",
        "time": "2018-08-11T10:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "In 2017, FireEye conducted an incident response at a critical infrastructure facility where a sophisticated threat actor deployed the TRITON attack framework for implanting Safety Instrumented System (SIS) controllers with a passive backdoor, which would allow an attacker to inject potentially destructive payloads at a later point in time. TRITON is the most complex publicly known embedded system exploit to date. While the functionality of the malware is understood, little known about attacker efforts when developing such an implant. With a timeline of exploit development like TRITON being in a year range, complex embedded exploitation is currently considered to be a boutique hacking. However, the public release of much of the TRITON code can now facilitate less experienced threat actors with designing similar exploits. The goal of this talk is to provide the audience with a\"through the eyes of the attacker\" experience when designing advanced embedded systems exploits for Industrial Control Systems (ICS). This talk is based on our extensive experience in reverse engineering Real Time Operating Systems (RTOS)/firmwares and developing embedded exploits to cause physical damage. In the first part of the talk we will explain how to convert an 'undocumented device' into malicious code. We will share how to purchase industrial equipment and obtain needed documentation. After obtaining control over an embedded system, an actual attack still need to be performed. In the second part of the talk will concentrate on discovering exploitable firmware and hardware design features which would allow an attacker to impact industrial controller functions. We will present several scenarios such as hijacking internal clock, suppressing interrupts (IRQ config attack) and manipulation of the interrupt vector table (IVT), CPU pin configuration attack and placing code into TCM cache so it would not be even visible in the memory. The TRITON payload can be thought of as a four-stage shellcode. Attack code related to first three stages constituted a discussed backdoor implant capable of receiving and executing the fourth stage. This stage would have been an actual 'physical damage payload' performing the disruptive operations. However, the attacker was discovered while preparing the implant, before advancing to physical damage stage. In this part of the talk we will show how one can symbolically execute TRITON using ANGR framework and test a code for damage scenario written for any CPU/hardware architecture of choice. Developing embedded exploits requires a significant amount of effort but it is totally worth of investment. While a small fraction of asset owners is slowly embracing ICS network monitoring solutions, the attackers are going one layer lower—into the control equipment (race-to-the-bottom). Developing embedded implants is worth the efforts due to lacking tools for detecting such implants and we will see more of advanced embedded exploitation in the nearest future."
    },
    {
        "title": "The L0pht Testimony, 20 Years Later (and Other Things You Were Afraid to Ask)",
        "speaker": "The L0pht Testimony, 20 Years Later (and Other Things You Were Afraid to Ask)",
        "time": "2018-08-10T17:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "2018 is the 20th anniversary of the hacker think-tank L0pht Heavy Industries testimony before the US Senate Homeland Security & Governmental Affairs Committee on the topic of weak computer security in government. The testimony made national news when the group announced they could take down the Internet in 30 minutes. It was also the first-time hackers using handles appeared before a US Legislative body. Members of the L0pht have grown from their hacker roots to become distinguished leaders and contributors in the security community and beyond. They run multi-million dollar security-focused organizations, have lobbied the government for better security laws, work for some of the largest companies in the world, and continue to spread the message of the positive aspects of hacking. With several of the L0pht's original members, this discussion will cover the original testimony and the changes that have happened over the last 20 years. Is the government any more secure? Have they provided enough influence to help protect its citizens' data? What steps should we take to ensure user security and privacy in the future? We are hoping for audience participation and also welcome questions about any other time in the L0pht's relatively short, but poignant, existence."
    },
    {
        "title": "Who Controls the Controllers—Hacking Crestron IoT Automation Systems",
        "speaker": "Who Controls the Controllers—Hacking Crestron IoT Automation Systems",
        "time": "2018-08-10T12:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "While you may not always be aware of them or even have heard of them, Crestron devices are everywhere. They can be found in universities, modern office buildings, sports arenas, and even high-end Las Vegas hotel rooms. If an environment has a lot of audio/video infrastructure, needs to interconnect or automate different IoT and building systems, or just wants the shades to close when the TV is turned on, chances are high that a Crestron device is controlling things from behind the scenes. And as these types of environments become the norm and grow ever more complex, the number of systems that Crestron devices are connected to grows as well. But it is in large part because of this complexity that installing and programming these devices is difficult enough without considering adding security. Instead of being a necessity, it's an extra headache that almost always gets entirely passed over. In this talk, I will take a look at different Crestron devices from a security perspective and discuss the many vulnerabilities and opportunities for fun to be found within. I will demonstrate both documented and undocumented features that can be used to achieve full system compromise and show the need to make securing these systems a priority, instead of an afterthought, in every deployment. In short, hijinx will ensue."
    },
    {
        "title": "NSAPlayset: Audio",
        "speaker": "NSAPlayset: Audio",
        "time": "2018-08-11T12:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "NSA Playset is back just in time for the 1983 theme of DEF CON 26!  The NSA is the best Big Brother that we could have.  But, if you've always been asking yourself: Where does he get those wonderful toys?  You're in for some good news.  Now you can play along, too. We're building covert listening devices!  Capturing audio of the target has long been an intelligence goldmine and modern developments in signal processing make the loot even more valuable.  While implanted listening devices has a large body of open knowledge, we explore an area with a dearth of public knowledge and years of covert use.  We'll show off several of the approaches we took, including an updated and modernized use of RF retroreflection. Best of all, we'll do the neighborly thing and publish the technical details of the things we get working—and the things that don't work—to make it accessible and easy to do it all at home."
    },
    {
        "title": "I'll See Your Missile and Raise You A MIRV: An overview of the Genesis Scripting Engine",
        "speaker": "I'll See Your Missile and Raise You A MIRV: An overview of the Genesis Scripting Engine",
        "time": "2018-08-10T17:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "Typically, the activities of a malware attack occur on an execution timeline that generally consists of 3 segments—the vector, the stage, and the persistence. First, a vector, or method of exploitation is identified. This could be anything from logging in over a credentialed method like RDP or SSH and running a malicious payload directly, to exploiting a memory corruption vulnerability remotely. Second, that access is leveraged into running malicious code that prepares the victim for the deployment of persistence (commonly \"implant\"). While segments one and three have been extensively automated, a effective automated utility for deploying persistence in a dynamic and unified context has yet to present itself. Enter the Genesis Scripting Engine. The Genesis Scripting Engine, or Gscript for short, is a framework for building multi-tenant executors for several implants in a stager. The engine works by embedding runtime logic (powered by the V8 Javascript Virtual Machine) for each persistence technique. This logic gets run at deploy time on the victim machine, in parallel for every implant contained with the stager. The Gscript engine leverages the multi-platform support of Golang to produce final stage one binaries for Windows, Mac, and Linux. This talk will consist of an overview of the origins of the project,  a technical deep dive into the inner workings including the modified Javascript VM, a walk through of the CLI utility, and examples of how we've leveraged Gscript in the real world. Multiple demos involving practical application scenarios will be presented, as well as an opportunity for audience members to submit their own implants and have them built into a hydra on stage in a matter of minutes."
    },
    {
        "title": "Booby Trapping Boxes",
        "speaker": "Booby Trapping Boxes",
        "time": "2018-08-11T15:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "Ever worry about the hardware you leave behind? In a world where servers are co-located, and notebooks get left in hotel rooms, the ability to resist tampering, and if necessary actively respond to attack, has become increasingly important. And of course everybody knows the best booby traps are the ones you don't know are there. This talk will prepare you for life in 1984, where the maids are evil, and step brothers can't be trusted. Whether your running servers as a high value target, or simply want to protect your Monero private key, this talk will show you to achieve FIPS 140-2 level 4 security, without the FIPS 140-2 level 4 price tag. Specifically, we'll cover acquisition considerations, physical hardening, firmware mitigation, tamper detection and more."
    },
    {
        "title": "Please do not Duplicate: Attacking the Knox Box and Other Keyed Alike Systems",
        "speaker": "Please do not Duplicate: Attacking the Knox Box and Other Keyed Alike Systems",
        "time": "2018-08-10T10:30:00.000Z",
        "location": "Track 3",
        "duration": "20 minutes",
        "abstract": "Knox Boxes, along with other rapid entry systems are increasing in popularity, as they allow first responders such as police, fire, and paramedics to quickly gain access to a building in the event of an emergency without having to force entry. These devices rely on the security and key control provided by various locks to prevent unauthorized access to buildings. In this talk, I will focus on vulnerabilities of the widely used Knox Box and Medeco cam lock to key duplication attacks. I will demonstrate how a sufficiently skilled attacker could obtain a key that would grant them access to thousands of residential and commercial buildings throughout America, as well as show off new tools designed to streamline the process of duplicating physical keys using CAD and 3D printing. What could possibly go wrong when someone tries to backdoor an entire city?"
    },
    {
        "title": "Playing Malware Injection with Exploit thoughts",
        "speaker": "Playing Malware Injection with Exploit thoughts",
        "time": "2018-08-11T14:00:00.000Z",
        "location": "Track 3",
        "duration": "20 minutes",
        "abstract": "In the past, when hackers did malicious program code injection, they used to adopt RunPE, AtomBombing, cross-process creation threads, and other approaches. They could forge their own execution program as any critical system service. However with increasing process of anti-virus techniques, these sensitive approaches have been gradually proactively killed. Therefore, hackers began to aim at another place, namely memory-level weakness, due to the breakages of critical system service itself. This agenda will simply introduce a new memory injection technique that emerged after 2013, PowerLoadEx. Based on this concept,  three new injection methods will be disclosed as well. These makes good use of the memory vulnerability in Windows to inject malicious behavior into system critical services. The content will cover Windows reverse analysis, memory weakness analysis, how to use and utilize, and so on. The relevant PoC will be released at the end of the agenda."
    },
    {
        "title": "Man-In-The-Disk",
        "speaker": "Man-In-The-Disk",
        "time": "2018-08-12T13:00:00.000Z",
        "location": "Track 1",
        "duration": "20 minutes",
        "abstract": "Most of modern OS are using sandboxing in order to prevent malicious apps from affecting other apps or even harming the OS itself. Google is constantly reinforcing Android’s sandbox protection, introducing new features to prevent any kind of sandbox bypass.\n                                  \nIn this talk we want to shed new light on a less known attack surface which affects all Android devices and allows an attacker to hijack the communication between privileged apps and the disk, bypassing Android’s latest sandbox protection.\n \nThe problem begins when privileged apps interact with files stored in exposed areas, and even worse, some of them will unintentionally break the sandbox by insecurely appending such data to its confinements.\n \nCan you imagine if someone could execute code in the context of your keyboard, or install an unwanted app without your consent? Well… It’s hardly within the realm of imagination.\nThe external storage and network based vulnerabilities we discovered, can be leveraged by the attacker to corrupt data, steal sensitive information or even take control of your device."
    },
    {
        "title": "Securing our Nation's Election Infrastructure",
        "speaker": "Securing our Nation's Election Infrastructure",
        "time": "2018-08-10T10:00:00.000Z",
        "location": "Track 3",
        "duration": "20 minutes",
        "abstract": "Fair elections are at the core of every democracy and are of paramount importance to our national security. The confidence in our electoral process is fundamental to ensuring that every vote- and therefore every voice- matters. In recent years, our Nation has become increasingly uneasy about the potential threats to our election infrastructure. The activities to undermine the confidence in the 2016 presidential election have been well documented and the United States (U.S.) Government has assessed that our adversaries will apply lessons learned from the 2016 election and will continue in their attempts to influence the U.S. and their allies' upcoming elections, including the 2018 mid-term elections. As the lead agency for securing the Nation's cyber infrastructure, the Department of Homeland Security (DHS) has a mission to maintain public trust and protect America's election systems. In January 2017, the DHS Secretary designated election systems as critical infrastructure. This designation means election infrastructure has become a priority in shaping our planning and policy initiatives, as well as how we allocate our resources. DHS is working directly with election officials across 8,000 election jurisdictions and throughout 55 States and territories, to help them safeguard their systems. As the threat environment evolves, DHS will continue to work with state and local partners to enhance our understanding of the threat, share timely and actionable threat information, and provide essential physical and cybersecurity tools and resources available to the public and private sectors to increase security and resiliency. DHS is committed to ensuring that our adversaries never succeed with their campaign to undermine our democracy."
    },
    {
        "title": "Looking for the perfect signature: an automatic YARA rules generation algorithm in the AI-era",
        "speaker": "Looking for the perfect signature: an automatic YARA rules generation algorithm in the AI-era",
        "time": "2018-08-11T13:00:00.000Z",
        "location": "Track 3",
        "duration": "20 minutes",
        "abstract": "Given the high pace at which new malware variants are generated, antivirus programs struggle to keep their signatures up-to-date, and AV scanners suffer from a considerable quantity of false negatives. The generation of effective signatures against new malware variants, while avoiding false positive detections, is a highly desirable but challenging task, typically requiring a substantial portion of human expert’s time. Artificial intelligence techniques can be applied to solve the malware signature generation problem.\n\nThe ultimate goal is to develop an algorithm able to automatically create a generalized family signature, eventually reducing threat exposure and increasing the quality of the detection. The proposed technique automatically generates an optimal signature to identify a malware family with very high precision and good recall using heuristics, evolutionary and linear programming algorithms.\n\nIn this talk I will present YaYaGen (Yet Another YARA Rule Generator), a tool to automatically generate Android malware signatures. Performances have been evaluated on a massive dataset of millions of applications available in the Koodous project, showing that in a few minutes the algorithm can generate precise ruleset able to catch 0-day malware, better than human generated ones."
    },
    {
        "title": "One-Click to OWA",
        "speaker": "One-Click to OWA",
        "time": "2018-08-10T13:00:00.000Z",
        "location": "Track 3",
        "duration": "20 minutes",
        "abstract": "With the presense of 2FA/MFA solutions growing, the attack surface for external attackers that have successfully phished/captured/cracked credentials is shrinking. However, many 2FA/MFA solutions leave gaps in their coverage which can allow attackers to leverage those credentials. For example, while OWA may be protected with 2FA, the Exchange Web Services Management API (EWS) offers many of the same features and functionalities without the same protections.\n\nIn this talk, I will introduce ExchangeRelayX, an NTLM relay tool that provides attackers with access to an interface that resembles a victim's OWA UI and has many of its functionalities - without ever cracking the relayed credentials.  ExchangeRelayX takes advantage of the gap in some 2FA/MFA solutions protecting Exchange, potentially resulting in a single-click phishing scheme enabling an attacker to exfiltrate sensitive data, perform limited active-directory enumeration, and execute further internal phishing attacks."
    },
    {
        "title": "SMBetray—Backdooring and breaking signatures",
        "speaker": "SMBetray—Backdooring and breaking signatures",
        "time": "2018-08-11T14:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "When it comes to taking advantage of SMB connections, most tools available to penetration testers aim for system enumeration or for performing relay attacks to gain RCE. If signatures are required, or if the victims relayed are not local admins anywhere, that can put a real stint in leveraging SMB to gain any serious footholds in a network. Fortunately, the mentioned attacks are only the tip of the iceberg of the ways to gain RCE with insecure SMB connections – and there’s a new tool to help take full advantage of these opportunities."
    },
    {
        "title": "You're just complaining because you're guilty: A DEF CON Guide to Adversarial Testing of Software Used In the Criminal Justice System",
        "speaker": "You're just complaining because you're guilty: A DEF CON Guide to Adversarial Testing of Software Used In the Criminal Justice System",
        "time": "2018-08-11T10:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "Software is increasingly used to make huge decisions about people's lives and often these decisions are made with little transparency or accountability to individuals.  If there is any place where transparency, third-party review, adversarial testing and true accountability is essential, it is the criminal justice system. Nevertheless, proprietary software is used throughout the system, and the trade secrets of software vendors are regularly deemed more important than the rights of the accused to understand and challenge decisions made by these complex systems.  In this talk, we will lay out the map of software in this space from DNA testing to facial recognition to estimating the likelihood that someone will commit a future crime. We will detail the substantial hurdles that prevent oversight and stunning examples of real problems found when hard won third-party review is finally achieved.  Finally, we will outline what you as a concerned citizen/hacker can do.  Nathan Adams will demo his findings from reviewing NYC's FST source code, which was finally made public by a federal judge after years of the city's lab fighting disclosure or even review. Jerome Greco will provide his insight into the wider world of software used in the criminal justice system—from technology that law enforcement admits to using but expects the public to trust without question to technology that law enforcement denies when the evidence says otherwise. Jeanna Matthews will talk about the wider space of algorithmic accountability and transparency and why even open source software is not enough."
    },
    {
        "title": "Sex Work After SESTA/FOSTA",
        "speaker": "Sex Work After SESTA/FOSTA",
        "time": "2018-08-11T14:30:00.000Z",
        "location": "Track 2",
        "duration": "20 minutes",
        "abstract": "Surveillance had been a fact of life for sex workers wherever they have faced prohibition. Only two elements, communication and association, can differentiate between commercial and personal sex, criminal enforcement of prostitution laws have necessarily meant targeting the speech and affiliation of perceived sex workers. Enforcement of this nature is facilitated by profiling, institutional bias, and broad overreaching policies that fundamentally violate individual human rights. This has included condoms as evidence, non-consensual medical screenings, and targeted harassment of black transgender women as well as license plate recording projects and stings that focus disrupting immigration or migrant workers.  For all of its risks, screening potential clients is safer over email than it is in person during a street based negotiation often in an isolated part of town. SESTA (Stop Enabling Sex Traffickers Act) comes at a time when compelling research demonstrates that Craigslist resulted in a 17% drop in the female homicide rate. SESTA will also put victims at risk by delaying their identification and recovery by eliminating a digital paper trail. Additionally, Section 230 of the Communications Decency Act is a vital protection for a free internet. Subverting SESTA will create greater economic disparity between sex workers and ultimately empower pimps and agencies over independent  providers."
    },
    {
        "title": "An Attacker Looks at Docker: Approaching Multi-Container Applications",
        "speaker": "An Attacker Looks at Docker: Approaching Multi-Container Applications",
        "time": "2018-08-10T11:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "Containerization, such as that provided by Docker, is becoming very popular among developers of large-scale applications. The good news: this is likely to make your life easier as an attacker. While exploitation and manipulation of traditional monolithic applications might require specialized experience and training in the target languages and execution environment, applications made up of services distributed among multiple containers can be effectively explored and exploited \"from within\" using many of the system- and network-level techniques that attackers, such as penetration testers, already know. The goal of this talk is to provide a hacker experienced in exploitation and post-exploitation of networks and systems with an exposure to containerization and the implications it has on offensive operations. Docker is used as a concrete example for the case study. A hacker can expect to leave this presentation with a practical exposure to multi-container application post-exploitation."
    },
    {
        "title": "80 to 0 in under 5 seconds: Falsifying a medical patient's vitals",
        "speaker": "80 to 0 in under 5 seconds: Falsifying a medical patient's vitals",
        "time": "2018-08-11T16:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "It seems each day that passes brings new technology and an increasing dependence upon it. The medical field is no exception; medical professionals rely upon technology to provide them with accurate information and base life-changing decisions on this data. In recent years there has been more attention paid to the security of medical devices; however, there has been little research done on the unique protocols used by these devices. In large, health care systems medical personnel take advantage of to make decisions on patient treatment and other critical care, use central monitoring stations. This information is gathered from many devices on the network using uncommon networking protocols.  What if this information wasn't accurate when a doctor prescribed medication?  What if a patient was thought to be peacefully resting, when in fact they are under cardiac arrest? McAfee's Advanced Threat Research team has discovered a weakness in the RWHAT protocol, one of the networking protocols used by medical devices to monitor a patient's condition.  This protocol is utilized in some of the most critical systems used in hospitals.  This weakness allows the data to be modified by an attacker in real-time to provide false information to medical personnel.   Lack of authentication also allows rogue devices to be placed onto the network and mimic patient monitors.   This presentation will include a technical dissection of the security issues inherent in this relatively unknown protocol.  It will describe real-world attack scenarios and demonstrate the ability to modify the communications in-transit to directly influence the receiving devices.  We will also explore the general lack of security mitigations in the medical devices field, the risks they pose, and techniques to address them.  The talk will conclude with a demonstration using actual medical device hardware and a live modification of a patient's critical data."
    },
    {
        "title": "Exploiting Active Directory Administrator Insecurities",
        "speaker": "Exploiting Active Directory Administrator Insecurities",
        "time": "2018-08-11T11:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "Defenders have been slowly adapting to the new reality: Any organization is a target. They bought boxes that blink and software that floods the SOC with alerts. None of this matters as much as how administration is performed: Pop an admin, own the system. Admins are being dragged into a new paradigm where they have to more securely administer the environment. What does this mean for the pentester or Red Teamer? Admins are gradually using better methods like two-factor and more secure administrative channels. Security is improving at many organizations, often quite rapidly. If we can quickly identify the way that administration is being performed, we can better highlight the flaws in the admin process. This talk explores some common methods Active Directory administrators (and others) use to protect their admin credentials and the flaws with these approaches. New recon methods will be provided on how to identify if the org uses an AD Red Forest (aka Admin Forest) and what that means for one hired to test the organization's defenses, as well as how to successfully avoid the Red Forest and still be successful on an engagement.Some of the areas explored in this talk:\n\t"
    },
    {
        "title": "Ridealong Adventures—Critical Issues with Police Body Cameras",
        "speaker": "Ridealong Adventures—Critical Issues with Police Body Cameras",
        "time": "2018-08-11T12:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "The police body camera market has been growing in popularity over the last few years. A recent (2016) Johns Hopkins University market survey found 60 different models have been produced specifically for law enforcement use. Rapid adoption is fueling this meteoric increase in availability and utilization. Additionally, device manufactures are attempting to package more and more technology into these devices. This has caused a deficiency in local municipalities' skills and budget to accurately assess the attack surface and exposure to the organization. Furthermore, departmental policies and procedures governing the secure deployment of these devices is largely insufficient. At DEF CON, we will be introducing tactics, techniques, and procedures to assess the security of these devices. We will cover attacks against the physical devices, RF components, smartphone app's, and desktop software. The capabilities demonstrated and discussed will encompass publicly and privately available technologies. Additionally, the talk will cover multiple products and vendors, shedding light on industry wide issues and trends. Finally, we will be releasing software to detect and track various devices and tie these issues into real world events."
    },
    {
        "title": "Compression Oracle Attacks on VPN Networks",
        "speaker": "Compression Oracle Attacks on VPN Networks",
        "time": "2018-08-11T11:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "Security researchers have done a good amount of practical attacks in the past using chosen plain-text attacks on compressed traffic to steal sensitive data. In spite of how popular CRIME and BREACH were, little was talked about how this class of attacks was relevant to VPN networks. Compression oracle attacks are not limited to just TLS protected data. In this talk, we try these attacks on browser requests and responses which usually tunnel their HTTP traffic through VPNs. We also show a case study with a well-known VPN server and their plethora of clients. We then go into practical defenses and how mitigations in HTTP/2's HPACK and other mitigation techniques are the way forward rather than claiming 'Thou shall not compress traffic at all.' One of the things that we would like to showcase is how impedance mismatches in these different layers of technologies affect security and how they don't play well together."
    },
    {
        "title": "One Step Ahead of Cheaters -- Instrumenting Android Emulators",
        "speaker": "One Step Ahead of Cheaters -- Instrumenting Android Emulators",
        "time": "2018-08-11T13:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "20 minutes",
        "abstract": "Commercial Android emulators such as NOX, BlueStacks and Leidian are very popular at the moment and most games can run on these emulators fast and soundly. The bad news for game vendors is that these emulators are usually shipped with root permission in the first place. On the other hand, cheating tools developers are happy because they can easily distribute their tools to abusers without requiring the abusers to have a physical rooted device, nor do they need to perform laborious tuning for different Android OS / firmware version. However, luckily for game vendors, commercial Android emulators usually use an x86/ARM mixed-mode emulation for speed-up. As a result, a standard native hooking/DBI framework won't work on this kind of platform. This drawback could discourage the cheating developers. In this talk, I will introduce a native hooking framework on such a kind of mixed-mode emulators. The talk will include the process start routine of both command-line applications and Android JNI applications as well as how these routines differ on an emulator. The different emulation strategies adopted by different emulators and runtime environments (Dalvik/ART) will also be discussed. Based on these knowledge, I will explain why the existing hooking/DBI frameworks do not work on these emulators and how to make one that works. Lastly, I will present a demo of using this hooking framework to cheat a game on emulator. With this demo, I will discuss how the dark market of mobile game cheating may develop in the foreseeable future."
    },
    {
        "title": "Reverse Engineering, hacking documentary series",
        "speaker": "Reverse Engineering, hacking documentary series",
        "time": "2018-08-10T17:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "We will present a sample scene and panel talk on our documentary series Reverse Engineering to the hacking community, which has been in the works for 4 years. We have dozens of interviews spanning the first 3 decades of computer hacking, ultimately there will be hundreds. It's a big story, but for the purposes of DEF CON, we've put together a 17 min. Scene covering the 80s WarGames/Legion of Doom-era of computer hacking in the US.  We've spoken to great people, but there are other viewpoints—this is a history that needs to be told by 1st person accounts. The accuracy and strength of our completed series is tantamount to the quality of who we interview and the questions that get asked. Accuracy is particularly important, there's been no shortage of media hype and lies regarding hacking since the 1980s.  Our vision for this film series is inclusive and collaborative. We'd like to hear from attendees how to best tell the origin story of hacking to new generations, and more so the outside world who've been fed a lot of myths by the media. Those are the lawmakers and citizens of tomorrow that we need to reach. Little attention has been paid to the pioneering hacker spirit that has literally changed every aspect of life. We want to address and correct that."
    },
    {
        "title": "Revolting Radios",
        "speaker": "Revolting Radios",
        "time": "2018-08-10T14:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "There are many Software Defined Radios (SDRs) available, with a great deal of time and effort having gone in to their design.  These are not those radios.  We present four radios that we have designed using crude, novel, and sometimes ridiculous methods for transmitting and receiving signals. The arrival of SDR allowed more hackers than ever to experiment with radio protocols, but we're still using hardware built by other people. In the time honored hacker tradition of rolling our own tools, we'll demonstrate four simple radios that can be home-built using commonly available parts for little to no cost."
    },
    {
        "title": "It WISN't me, attacking industrial wireless mesh networks",
        "speaker": "It WISN't me, attacking industrial wireless mesh networks",
        "time": "2018-08-11T10:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "Wireless sensor networks are commonly thought of as IoT devices communicating using familiar short-range wireless protocols like Zigbee, MiWi, Thread and OpenWSN. A lesser known fact is that about a decade ago, two industrial wireless protocols (WirelessHART and ISA100.11a) have been designed for industrial applications, which are based on the common IEEE 802.15.4 RF standard. These Wireless Industrial Sensor Networks (WISN) are used in process field device networks to monitor temperature, pressure, levels, flow or vibrations. The petrochemical industry uses WISN in oil and gas fields and plants around the world. Both IEC ratified standards have been commonly praised by the ICS industry for their security features, including strong encryption on multiple layers within the protocol stack, resistance to RF interference, and replay protection. While the standards in general look safe on paper, there are potential interesting attack vectors that require verification. However, security research so far has not yielded any significant results beyond basic attack vectors. Often these attacks have only been theorized, and not (publically) demonstrated. In addition, vendor implementations have not been thoroughly tested for security by independent third parties, due to protocol complexity and the lack of proper (hardware/software) tools. We strongly believe in Wright's principle,\"Security does not improve until practical tools for exploration of the attack surface are made available.\""
    },
    {
        "title": "ThinSIM-based Attacks on Mobile Money Systems",
        "speaker": "ThinSIM-based Attacks on Mobile Money Systems",
        "time": "2018-08-09T10:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "Phone-based mobile money is becoming the dominant paradigm for financial services in the developing world processing more than a billion dollars per day for over 690 million users. For example, mPesa has an annual cash flow of over thirty billion USD, equivalent to nearly half of Kenya's GDP. Numerous other products exist inside of nearly every other market, including GCash in the Philippines and easyPaisa in Pakistan. As a part of this growth, competitors have appeared who leverage ThinSIMS, small SIM card add ons, to provide alternative mobile money implementations without operating their own mobile networks. However, the security implications of ThinSIMs are not well understood. This talk dives into decade old telecom standards to explore how ThinSIMs work and what attackers of mobile money systems can do when they control the interface between the SIM card and the phone.  We will also demo two proof of concept exploits that use ThinSIMs to steal money from mobile money platforms and detail the difficulties of defense."
    },
    {
        "title": "All your family secrets belong to us—Worrisome security issues in tracker apps",
        "speaker": "All your family secrets belong to us—Worrisome security issues in tracker apps",
        "time": "2018-08-11T16:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "Google Play Store provides thousands of applications for monitoring your children/family members. Since these apps deal with highly sensitive information, they immediately raise questions on privacy and security. Who else can track the users? Is this data properly protected? To answer these questions, we analyzed a selection of the most popular tracking apps from the Google Play Store. Many apps and services suffer from grave security issues. Some apps use self-made algorithms instead of proper cryptography for data storage and transmission. Others do not even attempt to protect their communication at all and make use of the unprotected http protocol, or even give an attacker full access to a vulnerable backend system. Hard coded database credentials in apps allowed access to all stored user locations. We would be able to extract hundreds of thousands of tracking profiles, even in real time. In others, this wasn't even necessary, because the user authentication could be bypassed altogether. Flaws in server API allowed us to extract all user credentials (1.7m plain text passwords), further we saw full communication histories containing messages, pictures and location data. In total, the state of tracker apps is worrisome, effectively leading to users unknowingly installing espionage software on their devices."
    },
    {
        "title": "Tineola: Taking a Bite Out of Enterprise Blockchain",
        "speaker": "Tineola: Taking a Bite Out of Enterprise Blockchain",
        "time": "2018-08-11T12:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "Blockchain adaptation has reached a fever pitch, andthe community is late to the game of securing these platforms against attack. With the open source community enamored with the success of Ethereum, the enterprise community has been quietly building the next generation of distributed trustless applications on permissioned blockchain technologies. As of early 2018, an estimated half of these blockchain projects relied on the Hyperledger Fabric platform.\n \nIn this talk we will discuss tools and techniques attackers can use to target Fabric. To this end we are demoing and releasing a new attack suite, Tineola, capable of performing network reconnaissance of a Hyperledger deployment, adding evil network peers to this deployment, using existing trusted peers for lateral network movement with reverse shells, and fuzzing application code deployed on Fabric.\n \nAs George Orwell said: \"Who controls the past controls the future. Who controls the present controls the past.\" This talk will demonstrate how a sufficiently armed red team can modify the blockchain past to control our digital future."
    },
    {
        "title": "Breaking Extreme Networks WingOS: How to own millions of devices running on Aircrafts, Government, Smart cities and more.",
        "speaker": "Breaking Extreme Networks WingOS: How to own millions of devices running on Aircrafts, Government, Smart cities and more.",
        "time": "2018-08-12T11:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "Extreme network's embedded WingOS (Originally created by Motorola) is an operating system used in several wireless devices such as access points and controllers. This OS is being used in Motorola devices, Zebra devices and Extreme network's devices. This research started focusing in an access point widely used in many Aircrafts by several worldwide airlines but ended up in something bigger in terms of devices affected as this embedded operating system is not only used in AP's for Aircrafts but also in Healthcare, Government, Transportation, Smart cities, small to big enterprises... and more. Based on public information, we will see how vulnerable devices are actively used (outdoors) in big cities around the world. But also in Universities, Hotels,Casinos, Big companies, Mines, Hospitals and provides the Wi-Fi access for places such as the New york City Subway. In this presentation we will show with technical details how several critical vulnerabilities were found in this embedded OS. First we will introduce some internals and details about the OS and then we will show the techniques used to reverse engineering the mipsN32 ABI code for the Cavium Octeon processor. It will be discussed how some code was emulated to detect how a dynamic password is generated with a cryptographic algorithm for a root shell backdoor. Besides, it will be shown how some protocols used by some services were reverse engineered to find unauthenticated heap and stack overflow vulnerabilities that could be exploitable trough Wireless or Ethernet connection. This OS also uses a proprietary layer 2/3 protocol called MiNT. This protocol is used for communication between WingOS devices through VLAN or IP. This protocol was also reverse engineered and remote heap/stack overflow vulnerabilities were found on services using this protocol and will be shown. As a live demonstration, 2 devices will be used to exploit a remote stack overflow chaining several vulnerabilities as the attacker could do inside an aircraft (or other scenarios) through the Wi-Fi. As there are not public shellcodes for mipsN32 ABI, the particularities of creating a Shellcode for mipsN32 ABI will be also discussed."
    },
    {
        "title": "Reaping and breaking keys at scale: when crypto meets big data",
        "speaker": "Reaping and breaking keys at scale: when crypto meets big data",
        "time": "2018-08-11T13:00:00.000Z",
        "location": "Track 2",
        "duration": "20 minutes",
        "abstract": "Public keys are everywhere, after all, they are public. These keys are waiting to be reaped by those who know their real value. Hidden behind this public face lurks some potentially dangerous issues which could lead to a compromise of data and privacy. Leveraging hundreds of minion devices, we built a public key reaping machine (which we are open sourcing) and operated it on a global scale. Collected keys are tested for vulnerabilities such as the recent ROCA vulnerability or factorization using batch-GCD. We've collected over 300 million keys so far and built a database 4 to 10 times bigger than previous public works. Performing the initial computation on over 300 million keys took about 10 days on a 280 vCPU cluster. Many optimizations allow our tool to incrementally test new RSA keys for common prime factors against the whole dataset in just a few minutes. As a result of our research, we could have impersonated hundreds of people by breaking their PGP keys, mimicked thousands of servers thanks to their factored SSH keys and performed MitM attacks on over 200k websites relying on vulnerable X509 certificates. In the end, we were able to do this in an entirely passive way. Going further is possible, but it would lead us to the dark side. Would big brother hesitate to go there?"
    },
    {
        "title": "Finding Xori: Malware Analysis Triage with Automated Disassembly",
        "speaker": "Finding Xori: Malware Analysis Triage with Automated Disassembly",
        "time": "2018-08-10T13:00:00.000Z",
        "location": "Track 2",
        "duration": "20 minutes",
        "abstract": "In a world of high volume malware and limited researchers we need a dramatic improvement in our ability to process and analyze new and old malware at scale. Unfortunately what is currently available to the community is incredibly cost prohibitive or does not rise to the challenge. As malware authors and distributors share code and prepackaged tool kits, the corporate sponsored research community is dominated by solutions aimed at profit as opposed to augmenting capabilities available to the broader community. With that in mind, we are introducing our library for malware disassembly called Xori as an open source project. Xori is focused on helping reverse engineers analyze binaries, optimizing for time and effort spent per sample. Xori is an automation-ready disassembly and static analysis library that consumes shellcode or PE binaries and provides triage analysis data. This Rust library emulates the stack, register states, and reference tables to identify suspicious functionality for manual analysis. Xori extracts structured data from binaries to use in machine learning and data science pipelines. We will go over the pain-points of conventional open source disassemblers that Xori solves, examples of identifying suspicious functionality, and some of the interesting things we've done with the library.  We invite everyone in the community to use it, help contribute and make it an increasingly valuable tool for researchers alike."
    },
    {
        "title": "Synfuzz: Building a Grammar Based Re-targetable Test Generation Framework ",
        "speaker": "Synfuzz: Building a Grammar Based Re-targetable Test Generation Framework ",
        "time": "2018-08-10T10:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "Fuzzers have played an important role in the discovery of reliability and security flaws in software for decades. They have allowed for test case generation at a rate impossible by hand and the creation of test cases humans may never conceive of. While there are many excellent fuzzers available most are designed for mutating source files or input in random ways and attempting to discover edge cases in the handling of them. Some others are designed with structured input in mind and use grammars to more strategically generate and mutate possible inputs that adhere to the format defined. These specifically are the ones we care about for the goals of identifying differences between multiple implementations of a single language, finding bugs in parse tree generation/handling of tokens, and handling of the data at runtime once it has been successfully lexically and syntactically analyzed. We'll look at some of the shortcomings of existing fuzzers and discuss the implementation for a new platform designed to make fuzzer creation easier with the goal of being able utilize grammars from the implementations of the languages themselves."
    },
    {
        "title": "Bypassing Port-Security In 2018: Defeating MacSEC and 802.1x-2010",
        "speaker": "Bypassing Port-Security In 2018: Defeating MacSEC and 802.1x-2010",
        "time": "2018-08-10T15:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "Existing techniques for bypassing wired port security are limited to attacking 802.1x-2004, which does not provide encryption or the ability to perform authentication on a packet-by-packet basis [1][2][3][4]. The development of 802.1x-2010 mitigates these issues by using MacSEC to provide Layer 2 encryption and packet integrity check to the protocol [5]. Since MacSEC encrypts data on a hop-by-hop basis, it successfully protects against the bridge-based attacks pioneered by the likes of Steve Riley, Abb, and Alva Duckwall [5][6]. In addition to the development of 802.1x-2010, improved 802.1x support by peripheral devices such as printers also poses a challenge to attackers. Gone are the days in which bypassing 802.1x was as simple as finding a printer and spoofing address, as hardware manufacturers have gotten smarter. In this talk, we will introduce a novel technique for bypassing 802.1x-2010 by demonstrating how MacSEC fails when weak forms of EAP are used. Additionally, we will discuss how improved 802.1x support by peripheral devices does not necessarily translate to improved port-security due to the widespread use of weak EAP. Finally, we will consider how improvements to the Linux kernel have made bridge-based techniques easier to implement and demonstrate an alternative to using packet injection for network interaction. We have packaged each of these techniques and improvements into an open source tool called Silent Bridge, which we plan on releasing at the conference."
    },
    {
        "title": "In Soviet Russia Smartcard Hacks You",
        "speaker": "In Soviet Russia Smartcard Hacks You",
        "time": "2018-08-11T13:00:00.000Z",
        "location": "Track 1",
        "duration": "20 minutes",
        "abstract": "The classic spy movie hacking sequence: The spy inserts a magic smartcard provided by the agency technicians into the enemy's computer, ...the screen unlocks... What we all laughed about is possible! Smartcards are secure and trustworthy. This is the idea smartcard driver developers have in mind when developing drivers and smartcard software. The work presented in this talk not only challenges, but crushes this assumption by attacking smartcard drivers using malicious smartcards. A fuzzing framework for *nix and Windows is presented along with some interesting bugs found by auditing and fuzzing smartcard drivers and middleware. Among them classic stack and heap buffer overflows, double frees, but also a replay attack against smartcard authentication. Since smartcards are used in the authentication process, a lot of vulnerabilities can be triggered by an unauthenticated user, in code running with high privileges. During the authors research, bugs were discovered in OpenSC (EPass, PIV, OpenPGP, CAC, Cryptoflex,...), YubiKey drivers, pam_p11, pam_pkc11, Apple smartcardservices..."
    },
    {
        "title": "All your math are belong to us",
        "speaker": "All your math are belong to us",
        "time": "2018-08-11T15:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "First of all, it's math. Not meth. So everybody be cool, I'm not gonna touch your central nervous system stimulant substances. Now that this is established, I can start telling my story. And this story, like all good stories, begins where it ends. Wait, no, not really. It begins at a birthday party where the sister of a friend asked if I could help her with MATLAB. No matter how horrible memories I had about MATLAB, I just couldn't say no. So the next day, there was I, sitting in my room, installing the trial. And that's when the hacking started... Believe me, there were a lot to hack in this case! Several gigabytes of installed materials, a few web servers, cloud integration, clustering capabilities, you name it. These software are bloated, they are basically their own little operating systems. Yup, I used plural. Because I thought why discriminate MATLAB? I should really give a chance to Maple and Mathematica to fail too!. I did, and they did fail, and these failures gave the material for my talk. Basically this will be a dump of exploits (RCEs, file disclosures, etc.), and if you use any of those software and you are at least a bit security conscious, you should definitely listen to it."
    },
    {
        "title": "House of Roman—a \"leakless\" heap fengshui to achieve RCE on PIE Binaries",
        "speaker": "House of Roman—a \"leakless\" heap fengshui to achieve RCE on PIE Binaries",
        "time": "2018-08-11T13:30:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "20 minutes",
        "abstract": "Regarding ptmalloc2, many heap exploitation techniques have been invented in the recent years, well documented on the famous how2heap repository, or as writeups of famous CTF challenges (like House of Orange). However, most of them require atleast a libc/heap leak , or fail in non-PIE binaries. My new technique titled House of Roman leverages a single bug to gain shell leaklessly on a PIE enabled Binary. I shall showcase the ease of aligning the heap to perform this attack, thus demonstrating its versatility. Since this a 20 mins talk, attendees should be aware of basic heap exploitation techniques, like fastbin attacks and unsorted bin attacks, and have a general idea of how the ptmalloc2 algorithm works. As a bonus, I also discuss how to land a fastbin chunk in memory regions with no size alignment (like __free_hook )."
    },
    {
        "title": "UEFI exploitation for the masses",
        "speaker": "UEFI exploitation for the masses",
        "time": "2018-08-10T14:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "So how do you debug bios and triage a vulnerability for exploitability with no stack trace or error log? How do BIOS developers do it? Do not worry! We will explain how anyone can have debug capabilities on modern Intel platforms and show you how this massively simplifies exploit dev. Developing an exploit for a BIOS vulnerability is a different experience than other types of exploit dev. Your available code base to draw from is unlike what you would expect when running at the operating system level and you have no gdb you can use. In this talk we will summarize BIOS exploitation techniques and dive deeper into the specifics of an exploit we developed to provide reliable arbitrary code execution for an\"over-the-internet\" bios update vulnerability we found and responsibly disclosed. We will explain the relevant parts of UEFI and talk more about the exploit mitigations that exist there. We will also explain how to explore System Management Mode (SMM) in an Intel based platform, utilizing Intel hardware debug capabilities on an Intel 8th gen platform to obtain SMRAM content, analyze its contents, and search for vulnerable code."
    },
    {
        "title": "Fuzzing Malware For Fun & Profit. Applying Coverage-guided Fuzzing to Find and Exploit Bugs in Modern Malware",
        "speaker": "Fuzzing Malware For Fun & Profit. Applying Coverage-guided Fuzzing to Find and Exploit Bugs in Modern Malware",
        "time": "2018-08-12T15:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "Practice shows that even the most secure software written by the best engineers contain bugs. Malware is not an exception. In most cases their authors do not follow the best secure software development practices thereby introducing an interesting attack scenario which can be used to stop or slow-down malware spreading, defend against DDoS attacks and take control over C&Cs and botnets. Several previous researches have demonstrated that such bugs exist and can be exploited. To find those bugs it would be reasonable to use coverage-guided fuzzing. This talk aims to answer the following two questions: ___ we defend against malware by exploiting bugs in them ? How can we use fuzzing to find those bugs automatically ? The author will show how we can apply coverage-guided fuzzing to automatically find bugs in sophisticated malicious samples such as botnet Mirai which was used to conduct one of the most destructive DDoS in history and various banking trojans. A new cross-platform tool implemented on top of WinAFL will be released and a set of 0day vulnerabilities will be presented. Do you want to see how a small addition to HTTP-response can stop a large-scale DDoS attack or how a smart bitflipping can cause RCE in a sophisticated banking trojan? If the answer is yes, this is definitely your talk."
    },
    {
        "title": "WAGGING THE TAIL—COVERT PASSIVE SURVEILLANCE AND HOW TO MAKE THEIR LIFE DIFFICULT",
        "speaker": "WAGGING THE TAIL—COVERT PASSIVE SURVEILLANCE AND HOW TO MAKE THEIR LIFE DIFFICULT",
        "time": "2018-08-09T14:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "In this modern digital age of technically competent adversaries we forget that there may still be a need to conduct old school physical surveillance against a target.  Many organisations utilise surveillance teams and these may be in-house in the case of government agencies or third-party teams contracted for a specific task and their targets range from suspected terrorists to people accused of bogus insurance claims. Whilst most people think that they may never be placed under surveillance some professions increase this probability.  For example, if you are a member of the press with sources that you only meet face to face you could be a target especially if the source is a whistleblower or has information that their employer would rather they didn't give to you.  Would it seem far-fetched to think that a hacker, security researcher or a member of the EFF could be placed under surveillance?  Maybe even some current and former DEF CON speakers and attendees? These teams are not the lone Private Investigator sat in their car at the bottom of your street but are highly trained individuals whose job is to remain undetected.  Their mission is to observe and identify interactions and document everything they see.  They aim to be \"The Grey Man\", that person, when asked to describe, you are unable to.  Their techniques have changed very little over decades because they work. This talk will focus on mobile and foot surveillance techniques used by surveillance teams.  It will also include tips on identifying if you are under surveillance and how to make their life difficult."
    },
    {
        "title": "Practical & Improved Wifi MitM with Mana",
        "speaker": "Practical & Improved Wifi MitM with Mana",
        "time": "2018-08-10T16:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "In 2014, we released the mana rogue AP toolkit at DEF CON 22. This fixed KARMA attacks which no longer worked against modern devices, added new capabilities such as KARMA against some EAP networks and provided an easy to use toolkit for conducting MitM attacks once associated. Since then, several changes in wifi client devices, including MAC randomisation, significant use of the 5GHz spectrum and an increased variety of configurations has made these attacks harder to conduct. Just firing up a vanilla script gets fewer credentials than it used to. To address this mana will be re-released in this talk with several significant improvements to make it easier to conduct rogue AP MitM attacks against modern devices and networks. After years of using mana in many security assessments, we've realised rogue AP'ing and MitM'ing is no simple affair. This extended talk will provide an overview of mana, the new capabilities and features, and walk attendees through three scenarios and their nuances:"
    },
    {
        "title": "Jailbreaking the 3DS through 7 years of hardening",
        "speaker": "Jailbreaking the 3DS through 7 years of hardening",
        "time": "2018-08-11T11:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "The 3DS was one of Nintendo's first serious attempts at security, featuring a cool microkernel based OS and actual exploit mitigations. That didn't stop it from getting hacked pretty hard, making it possible for people to write their own homebrew software for the console. But Nintendo isn't one to back off from a fight and, as a result, has put significant effort into not only fixing vulnerabilities but also introducing new security features targeted specifically at killing exploit techniques used by hackers. This talk will describe hacking the console through all these defensive features by walking through a 0-day exploit chain that takes us all the way from zero access to a full system jailbreak."
    },
    {
        "title": "Inside the Fake Science Factory",
        "speaker": "Inside the Fake Science Factory",
        "time": "2018-08-11T16:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "Fake News has got a sidekick and it's called Fake Science. This talk presents the findings and methodology from a team of investigative journalists, hackers and data scientists who delved into the parallel universe of fraudulent pseudo-academic conferences and journals; Fake science factories, twilight companies whose sole purpose is to give studies an air of scientific credibility while cashing in on millions of dollars in the process. Until recently, these fake science factories have remained relatively under the radar, with few outside of academia aware of their presence; but the highly profitable industry is growing significantly and with it, so are the implications. To the public, fake science is indistinguishable from legitimate science, which is facing similar accusations itself. Our findings highlight the prevalence of the pseudo-academic conferences, journals and publications and the damage they can and are doing to society."
    },
    {
        "title": "Hacking BLE Bicycle Locks for Fun and a Small Profit",
        "speaker": "Hacking BLE Bicycle Locks for Fun and a Small Profit",
        "time": "2018-08-12T14:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "Hack a lock and get free rides! (No free beer yet though...). This talk will explore the ever growing ride sharing economy and look at how the BLE \"Smart\" locks on shared bicycles work. The entire solution will be deconstructed and examined, from the mobile application to its supporting web services and finally communications with the lock. We will look at how to go about analysing communications between a mobile device and the lock, what works, what doesn't. Previous talks on attacking BLE targeted the protocol itself using various hardware and software such as Ubertooth and Wireshark, which could be potentially difficult for someone new wanting to explore BLE and the ever connected IoT world. I'll simplify and stupidify the entire process such that anyone with a mobile phone and basic experience with Frida can go about breaking locks and hacking BLE the world over."
    },
    {
        "title": "You can run, but you can't hide.  Reverse engineering using X-Ray.",
        "speaker": "You can run, but you can't hide.  Reverse engineering using X-Ray.",
        "time": "2018-08-10T13:30:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "20 minutes",
        "abstract": "Most of us have knowledge of PCB construction. In the past reversing someone's design was an easy task due to the simplicity of the PCB design. Now with BGA's( Ball Grid Array's), manufacturers using several plane layers cover the entire PCB design and obscuring the details of the PCB from view. Thru the use of X-Ray, we are able to reverse engineer virtually anything. Slides will be presented show several PCB designs and how easy it was to reverse engineer the PCB. Also presenting videos of live views and dynamic zoom; this will demonstrate the true power of the X-Ray and its ability to see sub-micron features within the PCB structure and devices while manipulating the PCB."
    },
    {
        "title": "Weaponizing Unicode: Homographs Beyond IDNs",
        "speaker": "Weaponizing Unicode: Homographs Beyond IDNs",
        "time": "2018-08-10T15:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "Most people are familiar with homograph attacks due to phishing or other attack campaigns using Internationalized Domain Names with look-alike characters. But homograph attacks exist against wide variety of systems that have gotten far less attention. This talk discusses the use of homographs to attack machine learning systems, to submit malicious software patches, and to craft cryptographic canary traps and leak repudiation mechanisms. It then introduces a generalized defense strategy that should work against homograph attacks in any context."
    },
    {
        "title": "The Road to Resilience: How Real Hacking Redeems this Damnable Profession",
        "speaker": "The Road to Resilience: How Real Hacking Redeems this Damnable Profession",
        "time": "2018-08-11T17:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "Two years ago Richard Thieme spoke on “Playing Through the Pain: The Impact of Dark Knowledge on Security and Intelligence Professionals” for Def Con 24. He relied on dozens of experiences provided by colleagues over a quarter-century, colleagues from NSA, CIA, corporate, and military. Responses to the presentation have often been emotional and have corroborated his thesis. The real impact of this work on people over the long term has to be mitigated by counter-measures and strategies so scars can be endured or,even better,incorporated and put to use.\n\nIn this presentation, Thieme elaborates those strategies and counter-measures. In what is likely his final speech at Def Con, he speaks directly to the “human in the machine” AS a human being. It’s not about leaving the profession: it’s about what we can do to thrive and transcend the challenges. It‘s about “saving this space,” this play space of hacking, work and life, and knowing the cost of being fully human while encountering dehumanizing impacts.\n\nIt is easier to focus on exploits, cool tools, zero days, and the games we play in the space that “makes us smile.” It is not so easy to know how to play through the pain successfully. The damage to us does not show up in brain scans. It shows up in our families, our relationships, and our lives.\n\nThieme is not preaching, he is sharing insights based on what he too has had to transcend in his own life. They call a lot of us “supernormals,” which means we discovered resilient responses to deprivation, abuse, profound loss … or the daily challenges of work that makes clear that evil is real. We are driven, we never quit, we fight through adversity, we create and recreate personas that work, we do what has to be done. It pays to know how we do that and know THAT we know so we can recreate resilience in the face of whatever comes our way. \n\nA contractor for NSA suggested that everyone inside the agency should see the video of “Playing Through the Pain.” A long-time Def Con attendee asks all new hires to watch “Staring into the Abyss,” a talk Thieme did a few years before. This subject matter is seldom discussed aloud “out here” and by all accounts is not taken seriously “inside,” which is perhaps why there have been half a dozen suicides lately at NSA and a CIA veteran said, “I have 23 suicides on my mind, the most recent senior people who could not live with what they knew.”\n\nThe assumption baked into this talk: real hacking, its ethos and its execution, provides the tools we need to do this damn thing right.\nThis talk is in honor of Perry Barlow and the EFF."
    },
    {
        "title": "Breaking Paser Logic: Take Your Path Normalization Off and Pop 0days Out!",
        "speaker": "Breaking Paser Logic: Take Your Path Normalization Off and Pop 0days Out!",
        "time": null,
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "We propose a new exploit technique that brings a whole-new attack surface to defeat path normalization, which is complicated in implementation due to many implicit properties and edge cases. This complication, being under-estimated or ignored by developers for a long time, has made our proposed attack vector possible, lethal, and general. Therefore, many 0days have been discovered via this approach in popular web frameworks written in trending programming languages, including Python, Ruby, Java, and JavaScript. Being a very fundamental problem that exists in path normalization logic, sophisticated web frameworks can also suffer. For example, we've found various 0days on Java Spring Framework, Ruby on Rails, Next.js, and Python aiohttp, just to name a few. This general technique can also adapt to multi-layered web architecture, such as using Nginx or Apache as a proxy for Tomcat. In that case, reverse proxy protections can be bypassed. To make things worse, we're able to chain path normalization bugs to bypass authentication and achieve RCE in real world Bug Bounty Programs. Several scenarios will be demonstrated to illustrate how path normalization can be exploited to achieve sensitive information disclosure, SMB-Relay and RCE. Understanding the basics of this technique, the audience won't be surprised to know that more than 10 vulnerabilities have been found in sophisticated frameworks and multi-layered web architectures aforementioned via this technique."
    },
    {
        "title": "Compromising online accounts by cracking voicemail systems",
        "speaker": "Compromising online accounts by cracking voicemail systems",
        "time": "2018-08-10T13:00:00.000Z",
        "location": "Track 1",
        "duration": "20 minutes",
        "abstract": "Voicemail systems have been with us since the 80s. They played a big role in the earlier hacking scene and re-reading those e-zines, articles and tutorials paints an interesting picture. Not much has changed. Not in the technology nor in the attack vectors. Can we leverage the last 30 years innovations to further compromise voicemail systems? And what is the real impact today of pwning these? In this talk I will cover voicemail systems, it's security and how we can use oldskool techniques and new ones on top of current technology to compromise them. I will discuss the broader impact of gaining unauthorized access to voicemail systems today and introduce a new tool that automates the process."
    },
    {
        "title": "Attacking the macOS Kernel Graphics Driver",
        "speaker": "Attacking the macOS Kernel Graphics Driver",
        "time": "2018-08-12T12:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "Just like the Windows platform, graphic drivers of macOS kernel are complicated and provide a large promising attack surface for EoPs and sandbox escapes from low-privileged processes. After auditing part of the binaries, I discovered a number of vulnerabilities last year. Including, NULL pointer dereference, stack-based buffer overflow, arbitrary kernel memory read and write, use-after-free, etc. Some of these vulnerabilities were reported to Apple Inc., such as the CVE-2017-7155, CVE-2017-7163, CVE-2017-13883.In this presentation, I will share with you the detailed information about these vulnerabilities. Furthermore, from the attacker's perspective, I will also reveal some new exploit techniques and zero-days."
    },
    {
        "title": "Fire & Ice: Making and Breaking macOS Firewalls",
        "speaker": "Fire & Ice: Making and Breaking macOS Firewalls",
        "time": "2018-08-11T14:30:00.000Z",
        "location": "Track 3",
        "duration": "20 minutes",
        "abstract": "In the ever raging battle between malicious code and anti-malware tools, firewalls play an essential role. Many a malware has been generically thwarted thanks to the watchful eye of these products. However on macOS, firewalls are rather poorly understood. Apple's documentation surrounding it's network filter interfaces is rather lacking and all commercial macOS firewalls are closed source. This talk aims to take a peek behind the proverbial curtain revealing how to both create and 'destroy' macOS firewalls. In this talk, we'll first dive into what it takes to create an effective firewall for macOS. Yes we'll discuss core concepts such as kernel-level socket filtering—but also how to communicate with user-mode components, install privileged code in a secure manner, and simple ways to implement self-defense mechanisms (including protecting the UI from synthetic events). Of course any security tool, including firewalls, can be broken. After looking at various macOS malware specimens that proactively attempt to detect such firewalls, we'll don our 'gray' (black?) hats to discuss various attacks against these products. And while some attacks are well known, others are currently undisclosed and can generically bypass even today's most vigilant Mac firewalls. But all is not lost. By proactively discussing such attacks, combined with our newly-found understandings of firewall internals, we can improve the existing status quo, advancing firewall development. With a little luck, such advancements may foil, or at least complicate the lives of tomorrow's sophisticated Mac malware!"
    },
    {
        "title": "The Mouse is Mightier than the Sword",
        "speaker": "The Mouse is Mightier than the Sword",
        "time": "2018-08-12T10:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "In today's digital world the mouse, not the pen is arguably mightier than the sword. Via a single click, countless security mechanisms may be completely bypassed. Run untrusted app? click ...allowed. Authorize keychain access? click ...allowed. Load 3rd-party kernel extension? click ...allowed. Authorize outgoing network connection? click ...allowed. Luckily security-conscious users will (hopefully) heed such warning dialogues—stopping malicious code in its tracks. But what if such clicks can be synthetically generated and interact with such prompts in a completely invisible way? Well, then everything pretty much goes to hell. Of course OS vendors such as Apple are keenly aware of this 'attack' vector, and thus strive to design their UI in a manner that is resistant against synthetic events. Unfortunately they failed. In this talk we'll discuss a vulnerability (CVE-2017-7150) found in all recent versions of macOS that allowed unprivileged code to interact with any UI component including 'protected' security dialogues. Armed with the bug, it was trivial to programmatically bypass Apple's touted 'User-Approved Kext' security feature, dump all passwords from the keychain, bypass 3rd-party security tools, and much more! And as Apple's patch was incomplete (surprise surprise) we'll drop an 0day that (still) allows unprivileged code to post synthetic events and bypass various security mechanisms on a fully patched macOS box! And while it may seem that such synthetic interactions with the UI will be visible to the user, we'll discuss an elegant way to ensure they happen completely invisibly!"
    },
    {
        "title": "Welcome To DEF CON & Badge Maker Talk",
        "speaker": "Welcome To DEF CON & Badge Maker Talk",
        "time": "2018-08-10T10:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": ""
    },
    {
        "title": "barcOwned—Popping shells with your cereal box",
        "speaker": "barcOwned—Popping shells with your cereal box",
        "time": "2018-08-12T13:00:00.000Z",
        "location": "Track 3",
        "duration": "20 minutes",
        "abstract": "Barcodes and barcode scanners are ubiquitous in many industries and work with untrusted data on labels, boxes, and even phone screens. Most scanners also allow programming via barcodes to manipulate and inject keystrokes. See the problem? By scanning a few programming barcodes, you can infect a scanner and access the keyboard of the host device, letting you type commands just like a Rubber Ducky. This culminates in barcOwned—a small web app that allows you to program scanners and execute complex, device-agnostic payloads in seconds. Possible applications include keystroke injection (including special keys), infiltration and exfiltration of data on air-gapped systems, and good ol' denial of service attacks."
    },
    {
        "title": "Betrayed by the keyboard: How what you type can give you away",
        "speaker": "Betrayed by the keyboard: How what you type can give you away",
        "time": "2018-08-12T14:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "45 minutes",
        "abstract": "Attribution is hard. Typically, the most useful identifiers—IP addresses, email address, domains, and so on—are also the easiest things to spoof, obfuscate, or anonymise. Whilst more advanced techniques, such as correlating malicious activity with timezones, or linking attacks through the use of similar techniques or malware, can be useful, they tend to take investigators further away from the individuals responsible; at best, some inference about the country or specific actor group/collective can be made. In this talk, I present a method for linking incidents to individual attackers with a high degree of accuracy, based on extremely fine-grained behavioural characteristics. This involves an investigatory technique known as \"case linkage analysis\" (CLA), which uses granular aspects of crime scene behaviours to link common offenders together through statistical comparison. It's been applied to some crime types before, but never to cyber attacks. I'll cover how CLA works, its advantages and disadvantages, and how it has previously been applied to a range of crimes, from burglary to homicide. I'll place it within the context of personality psychology, biometrics, forensic criminology, offender profiling, and forensic linguistics; and will walk through applying it practically. I'll then show the results of a novel experiment I conducted applying CLA to network intrusion attacks, which involved logging the keystrokes of volunteer attackers across different simulated intrusions, breaking these down into specific behaviours and syntax, and using these to link individuals to their offences. The end result: the way you type commands, including your choice and order of syntax, switches, and options, can form distinctive behavioural signatures, which can be used to link attackers together. Linking accuracy rates as high as 99% were achieved. Finally, I'll talk about the implications for both defenders and everyone else (particularly focusing on the privacy implications), explore ways in which these techniques could be defeated, and outline some ideas for future research in these areas."
    },
    {
        "title": "Hacking the Brain: Customize Evil Protocol to Pwn an SDN Controller",
        "speaker": "Hacking the Brain: Customize Evil Protocol to Pwn an SDN Controller",
        "time": "2018-08-10T13:30:00.000Z",
        "location": "Track 2",
        "duration": "20 minutes",
        "abstract": "Software-Defined Networking (SDN) is now widely deployed in production environments with an ever-growing community. Due to its popularity, many attacks are proposed against this novel network model. In this talk, we further extend SDN attack surface and propose the Custom Attack, a novel attack against SDN networks that can cause serious security risks by exploiting legitimate SDN protocol messages. Unlike many attacks leverage misbehaved protocol interactions to incur unexpected controller events, we craft malicious protocol messages to exploit complex software vulnerabilities in SDN components. Our research shows that it was possible for a weak adversary to execute arbitrary command or manipulate data in the SDN controller without accessing the SDN controller or any applications, but only controlling a host or network switch.\n\nTo the best of our knowledge, Custom Attack is the first attack that can compromise multiple components of the SDN framework (e.g., User Interface, Database, Third-party libraries etc.). Till now we have tested 5 most popular SDN controllers and their applications and found all of them are vulnerable to Custom Attack in some degree.\n\n\nThis presentation will include:\n"
    },
    {
        "title": "Privacy infrastructure, challenges and opportunities",
        "speaker": "Privacy infrastructure, challenges and opportunities",
        "time": "2018-08-10T15:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "We started our own transit Internet Service Provider (ISP) to safely route anonymized packets across the globe, and you can too. Emerald Onion is a Seattle-based 501(c)3 not-for-profit and we want to help other hacker collectives start their own. Getting your own Autonomous System Number (ASN), managing Internet Protocol (IP) scopes, using Border Gateway Protocol (BGP) in Internet Exchange Points (IXPs), dealing with abuse complaints or government requests for user data -- this is all stuff that you can do. Not every technologist is comfortable with launching and managing a nonprofit organization let alone has all of the technical knowhow to run an ISP. We didn't either when we started. We had a goal, and that was to route unfiltered Tor exit traffic in the Seattle Internet Exchange despite National Security Agency (NSA) wiretaps in the Westin Exchange Building. This talk will cover high level challenges and opportunities surrounding privacy infrastructure in the United States."
    },
    {
        "title": "Infecting The Embedded Supply Chain",
        "speaker": "Infecting The Embedded Supply Chain",
        "time": "2018-08-11T13:30:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "With a surge in the production of internet of things (IoT) devices, embedded development tools are becoming commonplace and the software they run on is often trusted to run in escalated modes. However, some of the embedded development tools on the market contain serious vulnerabilities that put users at risk. In this talk we discuss the various attack vectors that these embedded development tools expose users to, and why users should not blindly trust their tools. This talk will detail a variety reverse engineering, fuzzing, exploit development and protocol analysis techniques that we used to analyze and exploit the security of a common embedded debugger."
    },
    {
        "title": "Lora Smart Water Meter Security Analysis",
        "speaker": "Lora Smart Water Meter Security Analysis",
        "time": "2018-08-10T11:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "To avoid the tedious task of collecting water usage data by go user's home _ water meters that are equipped with wireless communication modules are now being put into use, in this talk we will take a water meter _which is using Lora wireless protocol_ as an example to analyze the security and privacy risks of this kind of meters_we will explain how to reverse engineer and analyze both the firmware and the hardware of a water meter system, we will be talking about its security risks from multiple perspectives , physical, data link, and sensors. Do notice that LORA is not only used in water meter ,it is being used in a lot of IoT scenarios_so the methods we employed to analyze LORA in this talk are also useful when you do tests of other LORA based systems ."
    },
    {
        "title": "Dissecting the Teddy Ruxpin: Reverse Engineering the Smart Bear",
        "speaker": "Dissecting the Teddy Ruxpin: Reverse Engineering the Smart Bear",
        "time": "2018-08-10T13:00:00.000Z",
        "location": "101 Track, Flamingo",
        "duration": "20 minutes",
        "abstract": "The Teddy Ruxpin is an iconic toy from the 1980's featuring an animatronic teddy bear that reads stories from cassette tapes to children. In late 2017, a new model of the toy was released with improvements including Bluetooth connectivity, LCD eyes, and a companion mobile application. While the new bear features a number of improvements, the Teddy Ruxpin's original ability to add new stories by replacing the included cassettes is no longer applicable, and it requires users to supply files to the bear in a proprietary format. This presentation aims to show how the new Teddy Ruxpin was reverse engineered down to a very low level in order to create new content. I will reveal the inner workings of the hardware and software within the bear and document the process used to reverse engineer it. I will then examine the communication between the mobile application and Teddy Ruxpin as well as the custom structure of the digital books read by the bear. I will end the presentation by releasing a toolset that allows users to create their own stories followed by a demo showcasing the Teddy Ruxpin greeting the DEF CON audience."
    },
    {
        "title": "Demystifying MS17-010: Reverse Engineering the ETERNAL Exploits",
        "speaker": "Demystifying MS17-010: Reverse Engineering the ETERNAL Exploits",
        "time": "2018-08-12T11:00:00.000Z",
        "location": "Track 3",
        "duration": "45 minutes",
        "abstract": "MS17-010 is the most important patch in the history of operating systems, fixing remote code execution vulnerabilities in the world of modern Windows. The ETERNAL exploits, written by the Equation Group and dumped by the Shadow Brokers, have been used in the most damaging cyber attacks in computing history: WannaCry, NotPetya, Olympic Destroyer, and many others. Yet, how these complicated exploits work has not been made clear to most. This is due to the ETERNAL exploits taking advantage of undocumented features of the Windows kernel and the esoteric SMBv1 protocol. This talk will condense years of research into Windows internals and the SMBv1 protocol driver. Descriptions of full reverse engineering of internal structures and all historical background info needed to understand how the exploit chains for ETERNALBLUE, ETERNALCHAMPION, ETERNALROMANCE, and ETERNALSYNERGY work will be provided. This talk will also describe how the MS17-010 patch fixed the vulnerabilities, and identify additional vulnerabilities that were patched around the same time."
    },
    {
        "title": "Fasten your seatbelts: We are escaping iOS 11 sandbox!",
        "speaker": "Fasten your seatbelts: We are escaping iOS 11 sandbox!",
        "time": "2018-08-10T13:30:00.000Z",
        "location": "Track 3",
        "duration": "20 minutes",
        "abstract": "Apple's sandbox was introduced as \"SeatBelt\" in macOS 10.5 which provided the first full-fledged implementation of the MACF policy. After a successful trial on macOS, Apple applied sandbox mechanism to iOS 6. In its implementation, the policy hooked dozens of operations. The number of hooks has been growing steadily when new system calls or newly discovered threats appeared. In the beginning, Apple's sandbox used a black list approach which means Apple originally concentrated on the known dangerous APIs and blocked them, allowing all others by default. However, with the evolution of Apple's sandbox, it applies a white list approach that denies all APIs and only allows secure ones that Apple trusts. In this talk, we will first introduce Apple's sandbox mechanism and profiles in the latest iOS. Then, we discuss iOS IPC mechanism and review several old classic sandbox escape bugs. Most importantly, we show two new zero-day sandbox escape vulnerabilities we recently discovered in the latest iOS 11.4. Besides, we share our experience of exploiting vulnerabilities in system services through OOL msg heap spray and ROP (Return-oriented programming). In addition, we discuss a task port exploit technique which can be used to control the whole remote process through Mach messages. By using these techniques, security researchers could find and exploit sandbox escape bugs to control iOS user mode system services and further attack the kernel."
    },
    {
        "title": "Your Peripheral Has Planted Malware—An Exploit of NXP SOCs Vulnerability",
        "speaker": "Your Peripheral Has Planted Malware—An Exploit of NXP SOCs Vulnerability",
        "time": "2018-08-10T16:00:00.000Z",
        "location": "Track 1",
        "duration": "45 minutes",
        "abstract": "There are billions of ARM Cortex M based SOC being deployed in embedded systems.  Most of these devices are Internet ready and definitely security is always the main concern. Vendors would always apply security measurements into the ARM Cortex M product for few major reasons: 1) People will not be able to copy and replicate the product; 2) License control for the hardware and software; 3) Prevent malicious code injection in to the firmware. Vendors normally rely on the security measurements built within the chip (unique ID number/signature) or security measurements built around the chip (secure boot).In this talk, we will share the ARM Cortex M SOC vulnerability that we discovered and it will be two parts:The first is security measurement build within the SOC and how we break it. We could gain control of changing the SOC unique ID and write the firmware or even turn the device into a trojan or bot.The second is security measure built around the SOC and how we break the Secure Boot elements and write into the firmware."
    },
    {
        "title": "Politics and the Surveillance State. The story of a young politician's successful efforts to fight surveillance and pass the nation's strongest privacy bills. ",
        "speaker": "Politics and the Surveillance State. The story of a young politician's successful efforts to fight surveillance and pass the nation's strongest privacy bills. ",
        "time": "2018-08-12T11:00:00.000Z",
        "location": "Track 2",
        "duration": "45 minutes",
        "abstract": "Orwell's concept of 1984 has more to do with government misuse of technology than technology itself. New technology allows for more opportunity, but unchecked, it allows for complete government control. Representative Daniel Zolnikov is the nation's leading politician regarding privacy and surveillance and has enacted numerous laws safeguarding fourth amendment rights regarding digital communications and technology. Daniel will walk you down the road of how political misuse of technology can and will turn the Federal Government into an unprecedented nanny state that will lead to a suppressed free flow of information and fear of stepping out of line. His story includes insights on how unique left and right coalitions were formed to pass these laws in his home state of Montana, and how he prevailed against law enforcement groups who opposed implementing warrant requirements. This discussion is aimed at sharing insights no matter your political affiliation. All of Daniel's legislation has passed with overwhelming bi-partisan support through both bodies in Montana's legislature and was signed by the governor of the opposite party. Although most speeches involving politicians tend to lead towards rhetoric, Daniel's goal is to share enough information to be able to understand why change has not taken place yet, and leave you understanding how to remedy that. His story will give you insights into the politics that states and the nation face when reforming these issues, and his down to earth approach will bring the topic down to a level of humor and easy understanding. There is no need for any technical or political insight to be able to appreciate this topic and the work Daniel has done on behalf of the more technologically savvy enthusiasts. The theme of DEF CON 26 would be inconsistent without taking into consideration policy and how it ties in closely with technology. Technology relies on policy, and policy has the implications of dictating the use of technology. The two can go hand in hand, or end up squaring up against each other. You are an important, and lesser heard voice in the world of aged politicians with limited vision. The Orwellian state existed due to a mixture of bad policies and technology. Although the theme focuses on technology used to disrupt the surveillance state, the other half of the battle is ensuring this state does not reach the disastrous conclusions of 1984. Daniel believes we can move forward with technology without living in fear of our government. If you want to have some hope and direction towards the future of policy regarding surveillance and technology, Daniel will leave you with the optimism that there is still a chance that our nation can have a balanced approach that ensures 1984 does not become the norm in the future and will help you understand how to take part in this action."
    }
]